{
    "OESX:US": {
        "description": "Orion Energy Systems, Inc. researches, designs, develops, manufactures, markets, sells, installs, and implements energy management systems for commercial office and retail, exterior area lighting, and industrial applications in North America. The company operates in three segments: Orion Engineered Systems, Orion Distribution Services, and Orion U.S. Markets. It offers interior light emitting diode (LED) high bay fixtures; smart building control systems, which provide lighting control options and data intelligence capabilities for building managers; and LED troffer door retrofit for use in office or retail grid ceilings. The company also offers various other LED and HIF fixtures for lighting and energy management needs comprising fixtures for agribusinesses, parking lots, roadways, retail, mezzanine, outdoor applications, and private label resale. In addition, it provides lighting-related energy management services, such as site assessment, site field verification, utility incentive and government subsidy management, engineering design, project management, installation, facility design commissioning, and recycling; and sells and distributes replacement lamps and fixture components into the after-market. The company serves customers directly; and through independent sales agencies and distributors, and electrical contractors and energy service companies. Orion Energy Systems, Inc. was incorporated in 1996 and is headquartered in Manitowoc, Wisconsin.",
        "exchange": "NASDAQ",
        "sector": "Industrials",
        "subindustry": "Electrical Components & Equipment",
        "industry": "Electrical Equipment",
        "market_cap": 141,
        "price": 4.57,
        "pe": "4.6",
        "ev_ebitda": "9.1"
    },
    "OFC:US": {
        "description": "COPT is a REIT that owns, manages, leases, develops and selectively acquires office and data center properties. The majority of its portfolio is in locations that support the United States Government and its contractors, most of whom are engaged in national security, defense and information technology (?IT?) related activities servicing what it believes are growing, durable, priority missions (?Defense/IT Locations?). The Company also owns a portfolio of office properties located in select urban/urban-like submarkets in the Greater Washington, DC/Baltimore region with durable Class-A office fundamentals and characteristics (?Regional Office Properties?). As of December 31, 2020, the Company derived 87% of its core portfolio annualized rental revenue from Defense/IT Locations and 13% from its Regional Office Properties. As of the same date and including 17 properties owned through unconsolidated joint ventures, COPT's core portfolio of 179 office and data center shell properties encompassed 20.8 million square feet and was 95.0% leased; the Company also owned one wholesale data center with a critical load of 19.25 megawatts that was 86.7% leased.",
        "exchange": "NYSE",
        "sector": "Real Estate",
        "subindustry": "Office REITs ",
        "industry": "Equity Real Estate \nInvestment Trusts \n(REITs)",
        "market_cap": 3185,
        "price": 28.34,
        "pe": "22.0",
        "ev_ebitda": "18.9"
    },
    "OFG:US": {
        "description": "OFG Bancorp, a financial holding company, provides a range of banking and financial services. It operates through three segments: Banking, Wealth Management, and Treasury. The company offers checking and savings accounts, as well as time deposit products; commercial, consumer, auto, and mortgage lending; financial planning; and corporate and individual trust services. It also provides securities brokerage and investment advisory services, including various investment alternatives, such as tax-advantaged fixed income securities, mutual funds, stocks, and bonds to retail and institutional clients; separately-managed accounts and mutual fund asset allocation programs; and retirement planning, pension administration, trust, and other financial services. In addition, the company involved in the insurance agency business; administration of retirement plans; various treasury-related functions with an investment portfolio consisting of mortgage-backed securities, obligations of U.S. government sponsored agencies, and securities and money market instruments; and management and participation in public offerings and private placements of debt and equity securities. Further, it offers investment brokerage, and money and interest rate risk management, as well as derivatives and borrowings activities. The company operates through a network of 54 branches in Puerto Rico and 2 branches in USVI. OFG Bancorp was founded in 1964 and is based in San Juan, Puerto Rico.",
        "exchange": "NYSE",
        "sector": "Financials",
        "subindustry": "Regional Banks",
        "industry": "Banks",
        "market_cap": 1359,
        "price": 27.08,
        "pe": "10.0",
        "ev_ebitda": "-5.9"
    },
    "OFIX:US": {
        "description": "Orthofix Medical Inc. operates as a medical device and biologics company in the United States, Italy, Germany, the United Kingdom, Brazil, and internationally. It operates through two segments, Global Spine and Global Extremities. The Global Spine segment manufactures, distributes, and provides support services for bone growth stimulator devices that enhance bone fusion, as well as used as a therapeutic treatment for non-spinal and appendicular fractures. This segment also designs, develops, and markets a portfolio of motion preservation and fixation implant products, which are used in surgical procedures of the spine; and a portfolio of regenerative products and tissue forms that allow physicians to treat a range of spinal and orthopedic conditions. The Global Extremities segment designs, develops, and markets orthopedic products that are used in fracture repair, deformity correction, and bone reconstruction procedures. The company markets and distributes its products through direct sales representatives; independent distributors; and employed and independent sales representatives to physicians, hospitals, ambulatory surgery centers, integrated health delivery systems, and other purchasing organizations. The company was formerly known as Orthofix International N.V. and changed its name to Orthofix Medical Inc. in July 2018. Orthofix Medical Inc. was founded in 1987 and is headquartered in Lewisville, Texas.",
        "exchange": "NASDAQ",
        "sector": "Health Care",
        "subindustry": "Health Care Equipment",
        "industry": "Health Care Equipment & Supplies",
        "market_cap": 689,
        "price": 34.95,
        "pe": "-85.0",
        "ev_ebitda": "12.2"
    },
    "OFLX:US": {
        "description": "Omega Flex, Inc., together with its subsidiaries, manufactures and sells flexible metal hoses and accessories in the United States and internationally. It offers flexible gas piping for use in residential and commercial buildings, as well as its fittings; and corrugated medical tubing for use in hospitals, ambulatory care centers, dental, physician and veterinary clinics, laboratories, and other facilities. The company sells its products under the TracPipe, CounterStrike, AutoSnap, AutoFlare, DoubleTrac, DEF-Trac, and MediTrac brand names. It serves various markets, including construction, manufacturing, transportation, petrochemical, pharmaceutical, and other industries. The company sells its products through independent sales representatives, distributors, original equipment manufacturers, and direct sales, as well as through its website. The company was formerly known as Tofle America, Inc. and changed its name to Omega Flex, Inc. in 1996. Omega Flex, Inc. was incorporated in 1975 and is based in Exton, Pennsylvania.",
        "exchange": "NASDAQ",
        "sector": "Industrials",
        "subindustry": "Industrial Machinery",
        "industry": "Machinery",
        "market_cap": 1453,
        "price": 143.97,
        "pe": "59.4",
        "ev_ebitda": "42.5"
    },
    "OGE:US": {
        "description": "OGE Energy Corp., together with its subsidiaries, operates as an energy and energy services provider that offers physical delivery and related services for electricity and natural gas primarily in the south-central United States. It operates in two segments, Electric Utility and Natural Gas Midstream Operations. The Electric Utility segment generates, transmits, distributes, and sells electric energy. This segment furnishes retail electric service in 267 communities and their contiguous rural and suburban areas; and owns and operates coal-fired, natural gas-fired, wind-powered, and solar-powered generating assets. Its service area covers 30,000 square miles in Oklahoma and western Arkansas, including Oklahoma City in Oklahoma; and Fort Smith, Arkansas. The Natural Gas Midstream Operations segment engages in gathering, processing, transporting, and storing natural gas; and the provision of crude oil gathering services, and interstate and intrastate natural gas pipeline transportation and storage services primarily to its producer, power plant, local distribution company, and industrial end-user customers. As of December 31, 2020, the company owned and operated interconnected electric generation, transmission, and distribution systems, including 15 generating stations with an aggregate capability of 7,120 megawatts; and transmission systems comprising 402 substations and 5,122 structure miles of lines in Oklahoma, and 36 substations and 277 structure miles of lines in Arkansas. Its distribution systems included 349 substations; 29,443 structure miles of overhead lines; 3,202 miles of underground conduit; and 11,038 miles of underground conductors in Oklahoma, as well as 29 substations, 2,788 structure miles of overhead lines, 338 miles of underground conduit, and 669 miles of underground conductors in Arkansas. The company was founded in 1902 and is headquartered in Oklahoma City, Oklahoma.",
        "exchange": "NYSE",
        "sector": "Utilities",
        "subindustry": "Electric Utilities",
        "industry": "Electric Utilities",
        "market_cap": 6807,
        "price": 34,
        "pe": "17.1",
        "ev_ebitda": "12.3"
    },
    "OGS:US": {
        "description": "ONE Gas, Inc. operates as a regulated natural gas distribution utility company in the United States. The company operates through three divisions: Oklahoma Natural Gas, Kansas Gas Service, and Texas Gas Service. It provides natural gas distribution services to 2.2 million customers in three states. The company serves residential, commercial, and transportation customers. As of December 31, 2020, it operated approximately 41,200 miles of distribution mains; and 2,600 miles of transmission pipelines, as well as had 48.4 billion cubic feet of natural gas storage capacity. The company was founded in 1906 and is headquartered in Tulsa, Oklahoma.",
        "exchange": "NYSE",
        "sector": "Utilities",
        "subindustry": "Gas Utilities",
        "industry": "Gas Utilities",
        "market_cap": 3655,
        "price": 68.94,
        "pe": "17.9",
        "ev_ebitda": "14.2"
    },
    "OHI:US": {
        "description": "Omega is a real estate investment trust that invests in the long-term healthcare industry, primarily in skilled nursing and assisted living facilities. Its portfolio of assets is operated by a diverse group of healthcare companies, predominantly in a triple-net lease structure. The assets span all regions within the US, as well as in the UK.",
        "exchange": "NYSE",
        "sector": "Real Estate",
        "subindustry": "Health Care REITs ",
        "industry": "Equity Real Estate \nInvestment Trusts \n(REITs)",
        "market_cap": 6978,
        "price": 28.91,
        "pe": "32.5",
        "ev_ebitda": "15.4"
    },
    "OI:US": {
        "description": "O-I Glass, Inc., through its subsidiaries, manufactures and sells glass containers to food and beverage manufacturers primarily in the Americas, Europe, and the Asia Pacific. The company produces glass containers for alcoholic beverages, including beer, flavored malt beverages, spirits, and wine. It is also involved in the production of glass packaging for various food items, soft drinks, tea, juices, and pharmaceuticals. The company offers glass containers in a range of sizes, shapes, and colors. It sells its products directly to customers under annual or multi-year supply agreements, as well as through distributors. The company was founded in 1903 and is headquartered in Perrysburg, Ohio.",
        "exchange": "NYSE",
        "sector": "Materials",
        "subindustry": "Metal & Glass Containers",
        "industry": "Containers & Packaging",
        "market_cap": 2040,
        "price": 13.01,
        "pe": "26.5",
        "ev_ebitda": "6.7"
    },
    "OII:US": {
        "description": "Oceaneering International, Inc. provides engineered services and products to the offshore oil and gas, defense, aerospace, and commercial theme park industries worldwide. The company's Subsea Robotics segment provides remotely operated vehicles (ROVs) to customers in the energy industry for drilling support and vessel-based services, including subsea hardware installation, construction, pipeline inspection, survey and facilities inspection, maintenance and repair. As of December 31, 2020, this segment owned 250 work-class ROVs. Its Manufactured Products segment provides production control umbilicals and connection systems; and program management, engineering design, fabrication/assembly, and installation to the commercial theme park industry, as well as mobile robotics solutions, including AGV technology to various industries. The company's Projects Group segment offers subsea installation and intervention, including riserless light well intervention services and inspection, and maintenance and repair services; installation and workover control systems, and ROV workover control systems; project management and engineering; and seabed preparation, route clearance, and trenching services for submarine cables for the renewable energy markets. Its Integrity Management & Digital Solutions segment provides asset integrity management, corrosion management, and inspection and non-destructive testing services to customers in the oil and gas, power generation, and petrochemical industries; software, digital, and connectivity solution for the energy industry; and software and analytical solutions for the bulk cargo maritime industry. The company's Aerospace and Defense Technologies segment offers government services and products, including engineering and related manufacturing in defense and space exploration activities principally to U.S. government agencies and their prime contractors. The company was founded in 1964 and is headquartered in Houston, Texas.",
        "exchange": "NYSE",
        "sector": "Energy",
        "subindustry": "Oil & Gas Equipment & Services",
        "industry": "Energy Equipment & Services",
        "market_cap": 1418,
        "price": 14.21,
        "pe": "-40.0",
        "ev_ebitda": "12.5"
    },
    "OIIM:US": {
        "description": "O2Micro International Limited, together with its subsidiaries, designs, develops, and markets integrated circuits and solutions for power management components and systems in China, the United States, Taiwan, Japan, Korea, Malaysia, Singapore, and internationally. The company offers analog and mixed-signal integrated circuits that manage and provide power for LCD and LED lighting; control and monitor battery charging and discharging in portable electronic devices and vehicles; perform DC/DC and AC/DC conversion; and provides select and switch functionality between power sources, and LED drivers for backlighting products. Its products are primarily used in the consumer electronics, computer, industrial, communication, and automotive markets for applications, including LCD and LED monitors, LCD and LED televisions, notebook and tablet computers, low/zero emission vehicles, mobile phones, power tools, energy efficient technology relating to batteries, LED lighting, including general lighting and portable electronics devices. The company sells its products through direct sales force, independent sales representatives, or distributors to OEMs, ODMs, and module makers. It also licenses its proprietary intellectual property to third parties; and provides design and engineering support services. The company was founded in 1995 and is headquartered in George Town, the Cayman Islands.",
        "exchange": "NASDAQ",
        "sector": "Information Technology",
        "subindustry": "Semiconductors",
        "industry": "Semiconductors & Semiconductor Equipment",
        "market_cap": 187,
        "price": 6.56,
        "pe": "13.7",
        "ev_ebitda": "9.8"
    },
    "OIS:US": {
        "description": "Oil States International, Inc., through its subsidiaries, provides oilfield products and services for the drilling, completion, subsea, production, and infrastructure sectors of the oil and gas industry worldwide. The company operates in three segments: Well Site Services, Downhole Technologies, and Offshore/Manufactured Products. The Well Site Services segment offers a range of equipment and services that are used to drill for, establish, and maintain the flow of oil and natural gas from a well throughout its lifecycle. It also provides services, including wellhead isolation, frac valve, wireline and coiled tubing support, flowback and well testing, pipe recovery, gravel pack and sand control, blowout preventer, and drilling services. The Downhole Technologies segment provides oil and gas perforation systems, and downhole tools in support of completion, intervention, wireline, and well abandonment operations. This segment also designs, manufactures, and markets its consumable engineered products to oilfield service, and exploration and production companies. The Offshore/Manufactured Products segment designs, manufactures, and markets capital equipment utilized on floating production systems, subsea pipeline infrastructure, and offshore drilling rigs and vessels; and short-cycle and other products. Its products include flexible bearings, advanced connector systems, high-pressure riser systems, deep water mooring systems, cranes, subsea pipeline products, and blow-out preventer stack integration products. This segment also provides short-cycle products, such as valves, elastomers, and other specialty products that are used in the land-based drilling and completion markets; and other products for use in industrial, military, and other applications. In addition, it offers specialty welding, fabrication, cladding and machining, offshore installation, and inspection and repair services. The company was incorporated in 1995 and is headquartered in Houston, Texas.",
        "exchange": "NYSE",
        "sector": "Energy",
        "subindustry": "Oil & Gas Equipment & Services",
        "industry": "Energy Equipment & Services",
        "market_cap": 421,
        "price": 6.87,
        "pe": "-6.7",
        "ev_ebitda": "46.2"
    },
    "OKE:US": {
        "description": "ONEOK, Inc., together with its subsidiaries, engages in gathering, processing, storage, and transportation of natural gas in the United States. It operates through Natural Gas Gathering and Processing, Natural Gas Liquids, and Natural Gas Pipelines segments. The company owns natural gas gathering pipelines and processing plants in the Mid-Continent and Rocky Mountain regions. It also gathers, treats, fractionates, and transports natural gas liquids (NGL), as well as stores, markets, and distributes NGL products. The company owns NGL gathering and distribution pipelines in Oklahoma, Kansas, Texas, New Mexico, Montana, North Dakota, Wyoming, and Colorado; terminal and storage facilities in Kansas, Missouri, Nebraska, Iowa, and Illinois; and NGL distribution and refined petroleum products pipelines in Kansas, Missouri, Nebraska, Iowa, Illinois, and Indiana, as well as owns and operates truck- and rail-loading, and -unloading facilities connected to NGL fractionation, storage, and pipeline assets. In addition, it operates regulated interstate and intrastate natural gas transmission pipelines and natural gas storage facilities. Further, the company owns and operates a parking garage in downtown Tulsa, Oklahoma; and leases excess office space. It operates 18,900 miles of natural gas gathering pipelines; 1,500 miles of FERC-regulated interstate natural gas pipelines; 5,100 miles of state-regulated intrastate transmission pipeline; and 6 NGL storage facilities. It serves integrated and independent exploration and production companies; NGL and natural gas gathering and processing companies; crude oil and natural gas production companies; propane distributors; municipalities; ethanol producers; and petrochemical, refining, and NGL marketing companies, as well as natural gas distribution companies, electric generation facilities, industrial companies, producers, processors, and marketing companies. The company was founded in 1906 and is headquartered in Tulsa, Oklahoma.",
        "exchange": "NYSE",
        "sector": "Energy",
        "subindustry": "Oil & Gas Storage & Transportation",
        "industry": "Oil, Gas & Consumable Fuels",
        "market_cap": 28932,
        "price": 64.88,
        "pe": "20.3",
        "ev_ebitda": "13.6"
    },
    "OLED:US": {
        "description": "Universal Display Corporation engages in the research, development, and commercialization of organic light emitting diode (OLED) technologies and materials for use in display and solid-state lighting applications. As of February 18, 2021, it owned, exclusively licenses, or had sole rights to sublicense approximately 5,000 issued and pending patents worldwide. The company licenses and supplies its proprietary UniversalPHOLED materials to display and lighting manufacturers, and others. It is also involved in the research, development, and commercialization of other OLED device and manufacturing technologies, including FOLED that are flexible OLEDs for the fabrication of OLEDs on flexible substrates; OVJP, an organic vapor jet printing technology; thin-film encapsulation technology for the packaging of flexible OLEDs and other thin-film devices, as well as for use as a barrier film for plastic substrates; and UniversalP2OLED, which are printable phosphorescent OLEDs. In addition, the company provides technology development and support services, including third-party collaboration and support to third parties for the commercialization of their OLED products. Further, it provides contract research services in the areas of chemical materials synthesis research, development, and commercialization for non-OLED applications. Universal Display Corporation was founded in 1985 and is headquartered in Ewing, New Jersey.",
        "exchange": "NASDAQ",
        "sector": "Information Technology",
        "subindustry": "Semiconductors",
        "industry": "Semiconductors & Semiconductor Equipment",
        "market_cap": 8271,
        "price": 175.42,
        "pe": "44.3",
        "ev_ebitda": "28.3"
    },
    "OLN:US": {
        "description": "Olin Corporation manufactures and distributes chemical products in the United States, Europe, and internationally. It operates through three segments: Chlor Alkali Products and Vinyls; Epoxy; and Winchester. The Chlor Alkali Products and Vinyls segment offers chlorine and caustic soda, ethylene dichloride and vinyl chloride monomers, methyl chloride, methylene chloride, chloroform, carbon tetrachloride, perchloroethylene, trichloroethylene, hydrochloric acid, hydrogen, bleach products, potassium hydroxide, chlorinated organics intermediates and solvents, and sodium hypochlorite. The Epoxy segment provides epoxy materials and precursors, including aromatics, such as acetone, bisphenol, cumene, and phenol, as well as allyl chloride, epichlorohydrin, and glycerin used for the manufacturers of polymers, resins and other plastic materials, water purification, and pesticides; liquid and solid epoxy resins that are used in adhesives, paints and coatings, composites, and flooring; and converted epoxy resins and additives for use in electrical laminates, paints and coatings, wind blades, electronics, and construction. The Winchester segment offers sporting ammunition products, including shotshells, small caliber centerfire, and rimfire ammunition products for hunters and recreational shooters, and law enforcement agencies; small caliber military ammunition products for use in infantry and mounted weapons; and industrial products comprising gauge loads and powder-actuated tool loads for maintenance applications in power and concrete industries, and powder-actuated tools in construction industry. The company markets its products through its sales force, as well as directly to various industrial customers, mass merchants, retailers, wholesalers, other distributors, and the U.S. Government and its prime contractors. Olin Corporation was founded in 1892 and is based in Clayton, Missouri.",
        "exchange": "NYSE",
        "sector": "Materials",
        "subindustry": "Commodity Chemicals",
        "industry": "Chemicals",
        "market_cap": 9682,
        "price": 60.75,
        "pe": "10.1",
        "ev_ebitda": "6.1"
    },
    "OLP:US": {
        "description": "One Liberty is a self-administered and self-managed real estate investment trust incorporated in Maryland in 1982. The Company acquires, owns and manages a geographically diversified portfolio consisting primarily of industrial, retail, restaurant, health and fitness and theater properties. Many of these properties are subject to long term net leases under which the tenant is typically responsible for the property's real estate taxes, insurance and ordinary maintenance and repairs.",
        "exchange": "NYSE",
        "sector": "Real Estate",
        "subindustry": "Diversified REITs",
        "industry": "Equity Real Estate \nInvestment Trusts \n(REITs)",
        "market_cap": 695,
        "price": 33.4,
        "pe": "16.0",
        "ev_ebitda": "21.1"
    },
    "FLCX:US": {
        "description": "flooidCX Corp. provides customer care and feedback solutions. It offers a suite of online customer relationship management solutions, including GripeVine, a consumer-to-business platform that helps to build a customer feedback-minded community; and Resolution1 that functions as a cloud-based customer experience workflow management platform, where businesses could manage the logistics of customer care, feedback, or inquiries throughout their entire organizations for small to medium-size enterprises, and large enterprises. flooidCX Corp. is based in Oakville, Canada.",
        "exchange": "OTC",
        "sector": null,
        "subindustry": null,
        "industry": null,
        "market_cap": 0,
        "price": 0.3301,
        "pe": "-0.0",
        "ev_ebitda": "0.0"
    },
    "OMC:US": {
        "description": "Omnicom Group Inc., together with its subsidiaries, provides advertising, marketing, and corporate communications services. It provides a range of services in the areas of advertising, customer relationship management, public relations, and healthcare. The company's services include advertising, branding, content marketing, corporate social responsibility consulting, crisis communications, custom publishing, data analytics, database management, digital/direct marketing, digital transformation, entertainment marketing, experiential marketing, field marketing, financial/corporate business-to-business advertising, graphic arts/digital imaging, healthcare marketing and communications, and in-store design services. Its services also comprise interactive marketing, investor relations, marketing research, media planning and buying, merchandising and point of sale, mobile marketing, multi-cultural marketing, non-profit marketing, organizational communications, package design, product placement, promotional marketing, public affairs, retail marketing, sales support, search engine marketing, shopper marketing, social media marketing, and sports and event marketing services. It operates in the United States, Canada, Puerto Rico, South America, Mexico, Europe, the Middle East, Africa, Australia, Greater China, India, Japan, Korea, New Zealand, Singapore, and other Asian countries. The company was incorporated in 1944 and is based in New York, New York.",
        "exchange": "NYSE",
        "sector": "Communication Services",
        "subindustry": "Advertising",
        "industry": "Media",
        "market_cap": 14672,
        "price": 69.02,
        "pe": "10.6",
        "ev_ebitda": "6.5"
    },
    "OMCL:US": {
        "description": "Omnicell, Inc., together with its subsidiaries, provides medication management automation solutions and adherence tools for healthcare systems and pharmacies the United States and internationally. The company offers central pharmacy automation solutions, including automated storage and retrieval systems, such as XR2 Automated Central Pharmacy System, a building block of autonomous pharmacy vision; IV compounding robots and workflow management systems; inventory management software; and controlled substance management systems. It also provides point of care automation solutions to improve clinician workflows in patient care areas of the healthcare system; XT Series automated dispensing systems for medications and supplies used in nursing units and other clinical areas of the hospital, as well as specialized automated dispensing systems for operating room; Omnicell Interface Software that offers interface and integration between its medication-use products or supply products, and a healthcare facility's in-house information management systems; and robotic dispensing systems for handling the stocking and retrieval of boxed medications. In addition, the company provides automated systems to help pharmacies in filling its multimed adherence packaging based on individual patient medication orders; single dose automation solutions to fill and label for incoming prescriptions; semi-automated filling equipment for the long-term care institutional pharmacy; and medication blister card packaging and packaging supplies to enhance medication adherence in non-acute care settings. Further, it offers EnlivenHealth Patient Engagement, a web-based nexus of solutions. The company was formerly known as Omnicell Technologies, Inc. and changed its name to Omnicell, Inc. in 2001. Omnicell, Inc. was incorporated in 1992 and is headquartered in Mountain View, California.",
        "exchange": "NASDAQ",
        "sector": "Health Care",
        "subindustry": "Health Care Technology",
        "industry": "Health Care Technology",
        "market_cap": 7815,
        "price": 179.78,
        "pe": "97.4",
        "ev_ebitda": "43.4"
    },
    "OMED:US": {
        "description": "OncoMed Pharmaceuticals, Inc., a clinical-stage biopharmaceutical company, focuses on discovering and developing novel therapeutics that address the fundamental biology driving cancer's growth, resistance, recurrence, and metastasis. It is developing Navicixizumab (anti-DLL4/VEGF Bispecific, OMP-305B83), a monoclonal antibody that targets Delta-like ligand 4 and vascular endothelial growth factor, which has completed a single-agent Phase Ia clinical trial in patients with advanced solid tumors; and Phase Ib clinical trials for patients with second-line metastatic colorectal cancer, as well as in Phase Ib clinical trial in patients with platinum-resistant ovarian cancer. The company is also developing Etigilimab (Anti-TIGIT, OMP-313M32), a T-cell immunoreceptor with immunoglobulin and ITIM domain, which is in Phase Ia/b clinical trials for patients with advanced or metastatic solid tumors. It has strategic alliances with Celgene Corporation for discovery, development, and commercialization of novel small molecule therapeutics; and Bayer Pharma AG for discovery, development, and commercialization of anti- cancer stem cell biologic and small molecule therapeutics targeting the Wnt signaling pathway. OncoMed Pharmaceuticals, Inc. was founded in 2004 and is headquartered in Redwood City, California.",
        "exchange": "NASDAQ",
        "sector": "Health Care",
        "subindustry": "Biotechnology",
        "industry": "Biotechnology",
        "market_cap": 0,
        "price": 0.89,
        "pe": "-0.0",
        "ev_ebitda": "8.8"
    },
    "RUN:US": {
        "description": "Sunrun Inc. engages in the design, development, installation, sale, ownership, and maintenance of residential solar energy systems in the United States. It also sells solar energy systems and products, such as panels and racking; and solar leads generated to customers. In addition, the company offers battery storage along with solar energy systems. Its primary customers are residential homeowners. The company markets and sells its products through direct-to-consumer approach across online, retail, mass media, digital media, canvassing, field marketing, and referral channels, as well as its partner network. Sunrun Inc. was founded in 2007 and is headquartered in San Francisco, California.",
        "exchange": "NASDAQ",
        "sector": "Industrials",
        "subindustry": "Electrical Components & Equipment",
        "industry": "Electrical Equipment",
        "market_cap": 11979,
        "price": 58.17,
        "pe": "-60.8",
        "ev_ebitda": "-53.1"
    },
    "OMEX:US": {
        "description": "Odyssey Marine Exploration, Inc., together with its subsidiaries, engages in the deep-ocean exploration activities worldwide. The company provides specialized mineral exploration, project development, and marine services to clients. It offers research, scientific, resource assessment, marine operations planning, management execution, project planning, and project management services. Odyssey Marine Exploration, Inc. was founded in 1986 and is headquartered in Tampa, Florida.",
        "exchange": "NASDAQ",
        "sector": "Industrials",
        "subindustry": "Diversified Support Services",
        "industry": "Commercial Services & Supplies",
        "market_cap": 84,
        "price": 6.22,
        "pe": "-5.4",
        "ev_ebitda": "-7.3"
    },
    "OMI:US": {
        "description": "Owens & Minor, Inc., together with its subsidiaries, operates as a healthcare solutions company in the United States and internationally. It operates through two segments, Global Solutions and Global Products. The Global Solutions segment offers a portfolio of products and services to healthcare providers and manufacturers. Its portfolio of medical and surgical supplies includes branded products and its proprietary products. This segment also offers services to healthcare providers, which include supplier management, analytics, inventory management, and clinical supply management; and various programs to provide logistics and marketing solutions to its suppliers. The Global Products segment manufactures and sources medical surgical products for the prevention of healthcare-associated infections across the acute and alternate site channels. This segments products portfolio includes sterilization wraps, surgical drapes and gowns, facial protection products, protective apparel, medical exam gloves, custom and minor procedure kits, and other medical products. The company provides its products and services to multi-facility networks of healthcare providers, independent hospitals, surgery centers, physicians' practices, and networks of hospitals directly, as well as indirectly through third-party distributors. Owens & Minor, Inc. was founded in 1882 and is headquartered in Richmond, Virginia.",
        "exchange": "NYSE",
        "sector": "Health Care",
        "subindustry": "Health Care Distributors",
        "industry": "Health Care Providers & Services",
        "market_cap": 3316,
        "price": 43.76,
        "pe": "14.3",
        "ev_ebitda": "7.9"
    },
    "OMN:US": {
        "description": "OMNOVA Solutions Inc. provides specialty solutions and performance materials for various commercial, industrial, and residential end uses in the Americas, Europe, and Asia. The company operates through two segments, Specialty Solutions and Performance Materials. The Specialty Solutions segment designs, develops, produces, and markets specialty products for use in various applications, such as architectural and industrial coatings; nonwovens used in hygiene products, filtration, and construction; drilling additives for oil and gas drilling, cementing, and fracking; elastomeric modification of plastic casings and hoses used in household, industrial products, and automobiles; tapes and adhesives; sports surfaces; textile finishes; commercial building refurbishment; new construction; residential cabinets; flooring; ceiling tiles; furnishings; manufactured housing; health care patient; common area furniture; and various industrial films applications. This segment primarily sells its products directly to manufacturers. The Performance Materials segment produces latexes, resins, binders, antioxidants, hollow plastic pigment, coated fabrics, and rubber reinforcing products for use in tire cord, polymer stabilization, industrial rubber, carpet, paper, and various other applications. This segment distributes its products primarily through a direct sales force and agents to manufacturers of retail store fixtures, cabinets, furniture, seating, health care components, and other products. OMNOVA Solutions Inc. was founded in 1999 and is headquartered in Beachwood, Ohio.",
        "exchange": "NYSE",
        "sector": "Materials",
        "subindustry": "Specialty Chemicals",
        "industry": "Chemicals",
        "market_cap": 0,
        "price": 2910,
        "pe": "-0.0",
        "ev_ebitda": "4.1"
    },
    "ON:US": {
        "description": "ON Semiconductor Corporation, together with its subsidiaries, manufactures and sells semiconductor components for various electronic devices worldwide. The company operates in three segments: Power Solutions Group (PSG), Advanced Solutions Group (ASG), and Intelligent Sensing Group (ISG). The PSG segment offers analog, discrete, module, and integrated semiconductor products for various applications, such as power switching, power conversion, signal conditioning, circuit protection, signal amplification, and voltage regulation functions. The ASG segment designs and develops analog, mixed-signal, logic, ASSPs and ASICs, Wi-Fi, and power solutions. It also provides trusted foundry and design services for government customers; and manufacturing services. The ISG segment offers complementary metal oxide semiconductors image sensors; proximity sensors; image signal processors; single photon detectors, including SiPM and SPAD arrays; radars; and actuator drivers for autofocus and image stabilization for a range of customers in automotive, industrial, medical, aerospace/defense, communications, networking, wireless, consumer, and computing markets. The company serves original equipment manufacturers, distributors, and electronic manufacturing service providers. ON Semiconductor Corporation was incorporated in 1992 and is headquartered in Phoenix, Arizona.",
        "exchange": "NASDAQ",
        "sector": "Information Technology",
        "subindustry": "Semiconductors",
        "industry": "Semiconductors & Semiconductor Equipment",
        "market_cap": 25298,
        "price": 58.72,
        "pe": "37.6",
        "ev_ebitda": "16.2"
    },
    "ONB:US": {
        "description": "Old National Bancorp operates as the bank holding company for Old National Bank that provides various financial services to individual and commercial customers in the United States. The company accepts deposit accounts, including noninterest-bearing demand, interest-bearing checking, negotiable order of withdrawal, savings and money market, and time deposits; and offers loans, such as home equity lines of credit, residential real estate loans, consumer loans, commercial loans, commercial real estate loans, letters of credit, and lease financing. It also provides debit and automated teller machine cards, telephone access, online banking, and other electronic and mobile banking services; cash management, private banking, brokerage, trust, investment advisory, and other traditional banking services; wealth management, investment, and foreign currency services; and treasury management, merchant, health savings, and capital markets services, as well as community development lending and equity investment solutions. As of December 31, 2020, the company operated a total of 162 banking centers located primarily in the states of Indiana, Kentucky, Michigan, Minnesota, and Wisconsin. Old National Bancorp was founded in 1834 and is headquartered in Evansville, Indiana.",
        "exchange": "NASDAQ",
        "sector": "Financials",
        "subindustry": "Regional Banks",
        "industry": "Banks",
        "market_cap": 3034,
        "price": 18.23,
        "pe": "10.3",
        "ev_ebitda": "11.5"
    },
    "AGD:US": {
        "description": "Alpine Global Dynamic Dividend Fund is a closed ended equity mutual fund launched and managed by Alpine Woods Capital Investors, LLC. It invests in the public equity markets across the globe. The fund invests in stocks of companies operating across diversified sectors. It invests in growth and value stocks of companies across all market capitalizations. The fund employs a fundamental analysis with bottom up and top down stock picking approach, focusing on companies globally with potential for dividend increases and capital appreciation to create its portfolio. It benchmarks the performance of its portfolio against the S&P 500 Index, MSCI AC World Daily TR (Net Div) Index, and MSCI AC World Daily TR ex Japan (Gross Div) Index. Alpine Global Dynamic Dividend Fund was formed on May 11, 2006 and is domiciled in the United States.",
        "exchange": "NYSE",
        "sector": "N/A",
        "subindustry": "N/A",
        "industry": "N/A",
        "market_cap": 150,
        "price": 12.1,
        "pe": "2.9",
        "ev_ebitda": "3.0"
    },
    "ONTX:US": {
        "description": "Onconova Therapeutics, Inc., a clinical-stage biopharmaceutical company, focuses on discovering and developing novel products to treat cancer. The company has proprietary targeted anti-cancer agents designed to disrupt specific cellular pathways that are important for cancer cell proliferation. Its novel proprietary multi-kinase inhibitor ON 123300 to target CDK4/6 and other tyrosine kinases. The company's product candidate oral rigosertib, which is in Phase 1 study of rigosertib in combination with a PD-1 inhibitor for patients with progressive K-Ras mutated non-small cell lung cancer; and in Phase 1b/2 for recessive dystrophic epidermolysis bullosa. In addition, it is involved in preclinical work investigating rigosertib in COVID-19. The company has a license agreement with SymBio Pharmaceuticals Limited; and license, development, and commercialization agreement with Pint International SA. Onconova Therapeutics, Inc. was founded in 1998 and is headquartered in Newtown, Pennsylvania.",
        "exchange": "NASDAQ",
        "sector": "Health Care",
        "subindustry": "Pharmaceuticals",
        "industry": "Pharmaceuticals",
        "market_cap": 72,
        "price": 3.53,
        "pe": "-3.4",
        "ev_ebitda": "-1.4"
    },
    "MUC:US": {
        "description": null,
        "exchange": "NYSE",
        "sector": "N/A",
        "subindustry": "N/A",
        "industry": "N/A",
        "market_cap": 656,
        "price": 16.29,
        "pe": "18.4",
        "ev_ebitda": "18.4"
    },
    "OOMA:US": {
        "description": "Ooma, Inc. creates connected experiences for businesses and consumers in the United States, Canada, and internationally. The company's smart software-as-a-service and unified-communications-as-a-service (UCaaS) platforms serve as a communications hub, which offers cloud-based communications solutions, smart security, and other connected services. Its business and residential solutions deliver PureVoice high-definition voice quality, advanced functionality, and integration with mobile devices; and platform helps to create smart workplace and homes by offering communications, monitoring, security, automation, productivity, and networking infrastructure applications. The company's products and services include Ooma Office, a cloud-based multi-user communications system for small and medium-sized businesses; Ooma Office Pro that offers services, including HD video meetings, call recording, enhanced call blocking, and voicemail transcription; Ooma Connect, which delivers fixed wireless internet connectivity and Ooma Office phone services; Ooma Managed Wi-Fi, a plug-and-play enterprise-grade Wi-Fi solution; and Ooma Enterprise, an UCaaS solution. It also provides Ooma Mobile HD app that allows users to make and receive phone calls and access Ooma features and settings; Ooma Premier, a suite of advanced calling features; Ooma Telo, a home communications solution designed to serve as the primary phone line in the home; Ooma Telo 4G, an Ooma Telo with back-up internet service; and Ooma Telo Air, an Ooma Telo that connects to the internet wirelessly using the home's Wi-Fi network and can be paired with mobile phones to answer incoming mobile calls from any phone in the home. In addition, the company offers Ooma Smart Security, a security and monitoring platform; and Talkatone mobile app. It offers its products through direct sales, distributors, retailers, and resellers, as well as online. Ooma, Inc. was incorporated in 2003 and is headquartered in Sunnyvale, California.",
        "exchange": "NYSE",
        "sector": "Communication Services",
        "subindustry": "Integrated Telecommunication Services",
        "industry": "Diversified Telecommunication Services",
        "market_cap": 516,
        "price": 21.98,
        "pe": "-221.3",
        "ev_ebitda": "277.2"
    },
    "IRL:US": {
        "description": "The New Ireland Fund, Inc. is a close-ended balanced mutual fund launched by Bank of Ireland Asset Management (U.S.) Limited. It is managed by Kleinwort Benson Investors International Ltd. The fund invests in the public equity and fixed income markets of the Ireland. It seeks to invest in growth stocks of companies operating across diversified sectors. The fund benchmarks the performance of its portfolio against the ISEQ Index. It was formerly known as Irish Investment Fund Inc. The New Ireland Fund, Inc. was formed on December 14, 1989 and is domiciled in the United States.",
        "exchange": "NYSE",
        "sector": "N/A",
        "subindustry": "N/A",
        "industry": "N/A",
        "market_cap": 61,
        "price": 13.04,
        "pe": "2.0",
        "ev_ebitda": "1.9"
    },
    "OPK:US": {
        "description": "OPKO Health, Inc., a healthcare company, engages in the diagnostics and pharmaceuticals businesses in the United States, Ireland, Chile, Spain, Israel, Mexico, and internationally. The company's Diagnostics segment operates BioReference Laboratories that offers laboratory testing services for the detection, diagnosis, evaluation, monitoring, and treatment of diseases, including esoteric testing, molecular diagnostics, anatomical pathology, genetics, women's health, and correctional healthcare to physician offices, clinics, hospitals, employers and governmental units, as well as 4Kscore prostate cancer testing services. The company's Pharmaceutical segment offers Rayaldee for treatment for secondary hyperparathyroidism in adults with stage 3 or 4 chronic kidney disease, and vitamin D insufficiency; OPK88004, an orally administered selective androgen receptor modulator; OPK88003, a once-weekly administered peptide for the treatment of type 2 diabetes and associated obesity that is in Phase IIb trials; and hGH-CTP, a once-weekly human growth hormone injection that completed Phase III clinical trial in partnership with Pfizer, Inc. This segment develops and commercializes longer-acting proprietary versions of already approved therapeutic proteins. It also specialty active pharmaceutical ingredients; develops, manufactures, markets, and sells pharmaceutical, nutraceutical, veterinary, and ophthalmic products; commercializes food supplements and over the counter products; manufactures and sells products primarily in the generics market; and imports, markets, distributes, and sells pharmaceutical products in a range of indications, including cardiovascular products, vaccines, antibiotics, gastro-intestinal products, hormones, and others. In addition, the company operates pharmaceutical platforms in Ireland, Chile, Spain, and Mexico. OPKO Health, Inc. was incorporated in 1991 and is headquartered in Miami, Florida.",
        "exchange": "NASDAQ",
        "sector": "Health Care",
        "subindustry": "Biotechnology",
        "industry": "Biotechnology",
        "market_cap": 2841,
        "price": 4.17,
        "pe": "37.4",
        "ev_ebitda": "16.7"
    },
    "PDSB:US": {
        "description": "PDS Biotechnology Corporation, a clinical-stage biopharmaceutical company, focuses on developing multifunctional cancer immunotherapies. Its lead product candidate is PDS0101 (HPV16), which is in Phase II clinical trial provides a first line treatment for the recurrent/metastatic head and neck cancer, human papillomavirus associated malignancies, and cervical cancer. The company is also developing various product candidates, which are in preclinical trials, including PDS0102 T-cell receptor gamma alternate reading frame protein (TARP) for treating prostate and breast cancers; PDS0103 (MUC-1) for ovarian, colorectal, lung, and breast cancers; and PDS0104, which include Tyrosinase-related protein 2 for the treatment of melanoma. In addition, it is developing PDS0201 for treating tuberculosis; PDS0202, an influenza vaccine candidate; and PDS0203, a vaccine for the prevention of COVID-19. The company has a license and collaboration agreements with National Institutes of Health, Merck Eprova AG, The U.S. Department of Health and Human Services, and MSD International GmbH. PDS Biotechnology Corporation was founded in 2005 and is based in Florham Park, New Jersey.",
        "exchange": "NASDAQ",
        "sector": "Health Care",
        "subindustry": null,
        "industry": "Biotechnology",
        "market_cap": 325,
        "price": 11.44,
        "pe": "-23.4",
        "ev_ebitda": "-21.6"
    },
    "AZYO:US": {
        "description": "Aziyo Biologics, Inc., a regenerative medicine company, focuses on the development of regenerative medical products to address the implantable electronic device/cardiovascular, orthopedic/spinal repair, and soft tissue reconstruction markets. It offers CanGaroo that combines the envelope with antibiotics and is designed to reduce the risk of infection following surgical implantation of an electronic device; and cardiovascular products, such as ProxiCor for use as an intracardiac patch or pledget for tissue repairs; Tyke for use in neonates and infants to repair pericardial structures; and VasCure, a patch material to repair or reconstruct the peripheral vasculature, including the carotid, renal, iliac, femoral, and tibial blood vessels for cardiovascular, vascular, and general surgeons. The company also provides FiberCel, ViBone, and OsterGro V that are designed to protect and preserve native bone cells; and SimpliDerm, a pre-hydrated HADM designed to repair or replacement of damaged or inadequate integumental tissues. In addition, it offers contract manufacturing services for various products to corporate customers. The company sells its products to hospitals and other healthcare facilities through its direct sales force, commercial partners, and independent sales agents. Aziyo Biologics, Inc. was incorporated in 2015 and is headquartered in Silver Spring, Maryland.",
        "exchange": "NASDAQ",
        "sector": null,
        "subindustry": null,
        "industry": null,
        "market_cap": 64,
        "price": 6.3,
        "pe": "-3.3",
        "ev_ebitda": "-4.5"
    },
    "OPTT:US": {
        "description": "Ocean Power Technologies, Inc. develops and commercializes proprietary systems that generate electricity by harnessing the renewable energy of ocean waves in America, Europe, and Australia. It offers PB3 PowerBuoy system that generates power for use independent of the power grid in remote offshore locations. The company also provides hybrid PowerBuoy products; subsea battery systems; and payloads, integration services, and marine installation services. In addition, it offers electric power and real-time data communications for remote offshore and subsea applications in markets, such as offshore oil and gas, defense and security, science and research, and communications. The company serves public and private entities, and agencies that require remote offshore power. Ocean Power Technologies, Inc. was incorporated in 1984 and is headquartered in Monroe Township, New Jersey.",
        "exchange": "NYSEAMERICAN",
        "sector": "Industrials",
        "subindustry": "Heavy Electrical Equipment",
        "industry": "Electrical Equipment",
        "market_cap": 123,
        "price": 2.3,
        "pe": "-8.5",
        "ev_ebitda": "-3.1"
    },
    "OPY:US": {
        "description": "Oppenheimer Holdings Inc., through its subsidiaries, operates as a middle-market investment bank and full-service broker-dealer in the Americas, Europe, the Middle East, and Asia. The company offers brokerage services covering exchange-traded and over-the-counter corporate equity and debt securities, money market instruments, exchange-traded options and futures contracts, municipal bonds, mutual funds, exchange-traded funds, and unit investment trusts; financial and wealth planning services; and margin lending services. It also provides asset management services, including separately managed accounts, mutual fund managed accounts, discretionary portfolio management programs, non-discretionary investment advisory and consultation services, alternative investments, portfolio enhancement programs, and institutional taxable fixed income portfolio management strategies and solutions, as well as taxable and non-taxable fixed income portfolios and strategies. In addition, the company offers investment banking services, such as strategic advisory services and capital markets products; merger and acquisition, equities capital market, and debt capital market products and services; and institutional equity sales and trading, equity research, equity derivatives and index options, convertible bonds, and trading services. Further, it provides institutional fixed income sales and trading, fixed income research, public finance, and municipal trading services; repurchase agreements and securities lending services; and proprietary trading and investment activities. Additionally, the company offers underwritings, market-making, trust, and discount services. It serves high-net-worth individuals and families, corporate executives, public and private businesses, institutions and corporations, governments, financial sponsors, and domestic and international investors. The company was founded in 1881 and is headquartered in New York, New York.",
        "exchange": "NYSE",
        "sector": "Financials",
        "subindustry": "Investment Banking & Brokerage",
        "industry": "Capital Markets",
        "market_cap": 673,
        "price": 53.68,
        "pe": "3.8",
        "ev_ebitda": "3.6"
    },
    "ORA:US": {
        "description": "Ormat Technologies, Inc. engages in the geothermal and recovered energy power business in the United States, Indonesia, Kenya, Turkey, Chile, Guadeloupe, Guatemala, Ethiopia, New Zealand, Honduras, and internationally. The company operates through three segments: Electricity, Product, and Energy Storage. The Electricity segment develops, builds, owns, and operates geothermal, solar photovoltaic, and recovered energy-based power plants; and sells electricity. The Product segment designs, manufactures, and sells equipment for geothermal, recovered energy-based electricity generation, and remote power units, such as fossil fuel powered turbo-generators and heavy duty direct-current generators. This segment also provides services relating to the engineering, procurement, construction, operation, and maintenance of geothermal and recovered energy-based power plants. The Product segment serves contractors; developers, owners, and operators of geothermal power plants; and owners and operators of interstate natural gas pipelines, gas processing plants, and cement plants, as well as companies in other energy-intensive industrial processes. The Energy Storage segment offers energy storage and related services, as well as services relating to the engineering, procurement, construction, operation, and maintenance of energy storage units. Ormat Technologies, Inc. was founded in 1965 and is based in Reno, Nevada.",
        "exchange": "NYSE",
        "sector": "Utilities",
        "subindustry": "Renewable Electricity ",
        "industry": "Independent Power and Renewable Electricity Producers",
        "market_cap": 4375,
        "price": 78.14,
        "pe": "67.7",
        "ev_ebitda": "16.2"
    },
    "ORBC:US": {
        "description": "ORBCOMM Inc. provides Internet of Things solutions in the United States, South America, Japan, Europe, and internationally. The company offers network connectivity, devices, device management, and web reporting applications that are designed to track, monitor, control, and enhance security for various assets, such as trailers, trucks, rail cars, sea containers, power generators, fluid tanks, marine vessels, diesel or electric powered generators, oil and gas wells, pipeline monitoring equipment, irrigation control systems, and utility meters in transportation and supply chain, heavy equipment, fixed asset monitoring, and maritime industries, as well as for governments. It also provides satellite automatic identification service data services to assist in vessel navigation and to enhance maritime safety for government and commercial customers; and vehicle fleet management, as well as in-cab and fleet vehicle solutions using various network platforms, including its own constellation of low-earth orbit satellites and accompanying ground infrastructure, as well as terrestrial-based cellular communication services through reseller agreements with various cellular wireless providers. In addition, the company offers customer solutions utilizing additional satellite network service options through service agreements with third party mobile satellite providers; and resells service using the two-way Inmarsat plc satellite network to provide higher bandwidth. It markets and sells its products and services directly to original equipment manufacturers, government customers, and end-users, as well as indirectly through market channel partners and affiliates. ORBCOMM Inc. was founded in 1993 and is headquartered in Rochelle Park, New Jersey.",
        "exchange": "NASDAQ",
        "sector": "Communication Services",
        "subindustry": "Alternative Carriers",
        "industry": "Diversified Telecommunication Services",
        "market_cap": 915,
        "price": 11.49,
        "pe": "-23.8",
        "ev_ebitda": "22.3"
    },
    "ORBK:US": {
        "description": "Orbotech Ltd. provides yield-enhancing and process-enabling solutions for the manufacture of printed circuit boards (PCBs), flat panel displays (FPDs), semiconductor devices (SDs), and other electronic components in China, Taiwan, North America, Europe, Japan, Korea, and internationally. It operates through three segments: Production Solutions for the Electronics Industry, Solar Energy, and Recognition Software. The company designs, develops, manufactures, markets, and services direct imaging, automated optical inspection (AOI), automated optical shaping, via formation laser drilling tools, additive printing solutions, and other production systems used in the manufacture of PCBs; AOI, test, repair, and process monitoring systems for use in the manufacture of FPDs; and etch, physical vapor deposition, chemical vapor deposition, and molecular vapor deposition equipment used in the manufacture of SDs, such as micro-electro-mechanical systems, advanced semiconductor packaging, power and radio frequency devices, and high brightness light emitting diode devices. It is also involved in the research, development, and marketing of products for the deposition of thin film coating of various materials on crystalline silicon photovoltaic wafers for solar energy panels. In addition, the company develops and markets check processing and healthcare payments automation solutions to banks, financial, and other payment processing institutions and healthcare providers through system integrators and solution providers. The company was formerly known as Optrotech Ltd. and changed its name to Orbotech Ltd. as a result of its merger with Orbot Systems Ltd. in October 1992. Orbotech Ltd. was founded in 1981 and is headquartered in Yavne, Israel.",
        "exchange": "NASDAQ",
        "sector": "Information Technology",
        "subindustry": "Electronic Equipment & Instruments ",
        "industry": "Electronic Equipment, Instruments & Components",
        "market_cap": 0,
        "price": 65.77,
        "pe": "0.0",
        "ev_ebitda": "-1.7"
    },
    "ORC:US": {
        "description": "Orchid Island Capital, Inc., a specialty finance company, invests in residential mortgage-backed securities (RMBS) in the United States. The company's RMBS is backed by single-family residential mortgage loans, referred as Agency RMBS. Its portfolio includes traditional pass-through Agency RMBS, such as mortgage pass through certificates and collateralized mortgage obligations; and structured Agency RMBS, including interest only securities, inverse interest only securities, and principal only securities. The company qualifies as a real estate investment trust for federal income tax purposes. Orchid Island Capital, Inc. was incorporated in 2010 and is based in Vero Beach, Florida.",
        "exchange": "NYSE",
        "sector": "Financials",
        "subindustry": "Mortgage REITs",
        "industry": "Mortgage Real Estate Investment \nTrusts (REITs)",
        "market_cap": 804,
        "price": 4.99,
        "pe": "-216.4",
        "ev_ebitda": "-102.2"
    },
    "ORCL:US": {
        "description": "Oracle Corporation provides products and services that address enterprise information technology environments worldwide. Its Oracle cloud software as a service offering include various cloud software applications, including Oracle Fusion cloud enterprise resource planning (ERP), Oracle Fusion cloud enterprise performance management, Oracle Fusion cloud supply chain and manufacturing management, Oracle Fusion cloud human capital management, Oracle Fusion cloud advertising and customer experience, and NetSuite applications suite. The company also offers cloud-based industry solutions for various industries; Oracle application licenses; and Oracle license support services. In addition, it provides cloud and license business' infrastructure technologies, such as the Oracle Database, an enterprise database; Java, a software development language; and middleware, including development tools and others. The company's cloud and license business' infrastructure technologies also comprise cloud-based compute, storage, and networking capabilities through its Oracle cloud infrastructure as a service offerings. Further, it offers infrastructure offerings comprising Oracle autonomous data warehouse cloud service, Oracle autonomous transaction processing cloud service, Internet-of-Things, digital assistant, and blockchain. Additionally, the company provides hardware products and other hardware-related software offerings, including Oracle engineered systems, enterprise servers, storage solutions, industry-specific hardware, virtualization software, operating systems, management software, and related hardware services; and consulting services. The company markets and sells its cloud, license, hardware, support, and services offerings directly to businesses in various industries, government agencies, and educational institutions, as well as through indirect channels. Oracle Corporation was founded in 1977 and is headquartered in Austin, Texas.",
        "exchange": "NYSE",
        "sector": "Information Technology",
        "subindustry": "Systems Software",
        "industry": "Software",
        "market_cap": 259071,
        "price": 95.14,
        "pe": "18.6",
        "ev_ebitda": "15.8"
    },
    "ORI:US": {
        "description": "Old Republic International Corporation, through its subsidiaries, engages in the insurance underwriting and related services business primarily in the United States and Canada. The company operates through three segments: General Insurance, Title Insurance, and the Republic Financial Indemnity Group Run-off Business. The General Insurance segment offers automobile extended warranty, aviation, commercial automobile, commercial multi-peril, general liability, home warranty, inland marine, travel accident, and workers' compensation insurance products; and financial indemnity products for specialty coverages, including errors and omissions, fidelity, guaranteed asset protection, and surety. This segment provides its insurance products to businesses, government, and other institutions in transportation, commercial construction, healthcare, education, retail and wholesale trade, forest products, energy, general manufacturing, and financial services industries. The Title Insurance segment offers lenders' and owners' title insurance policies to real estate purchasers and investors based upon searches of the public records. This segment also provides escrow closing and construction disbursement services; and real estate information products, national default management services, and various other services pertaining to real estate transfers and loan transactions. The Republic Financial Indemnity Group Run-off Business segment offers private mortgage insurance coverage that protects mortgage lenders and investors from default related losses on residential mortgage loans made primarily to homebuyers. Old Republic International Corporation was founded in 1923 and is based in Chicago, Illinois.",
        "exchange": "NYSE",
        "sector": "Financials",
        "subindustry": "Property & Casualty Insurance",
        "industry": "Insurance",
        "market_cap": 7917,
        "price": 25.61,
        "pe": "5.5",
        "ev_ebitda": "-1.2"
    },
    "ORLY:US": {
        "description": "O'Reilly Automotive, Inc., together with its subsidiaries, operates as a retailer of automotive aftermarket parts, tools, supplies, equipment, and accessories in the United States. The company provides new and remanufactured automotive hard parts and maintenance items, such as alternators, batteries, brake system components, belts, chassis parts, driveline parts, engine parts, fuel pumps, hoses, starters, temperature control, water pumps, antifreeze, appearance products, engine additives, filters, fluids, lighting products, and oil and wiper blades; and accessories, including floor mats, seat covers, and truck accessories. Its stores offer auto body paint and related materials, automotive tools, and professional service provider service equipment. The company's stores also offer enhanced services and programs comprising used oil, oil filter, and battery recycling; battery, wiper, and bulb replacement; battery diagnostic testing; electrical and module testing; check engine light code extraction; loaner tool program; drum and rotor resurfacing; custom hydraulic hoses; and professional paint shop mixing and related materials. Its stores provide do-it-yourself and professional service provider customers a selection of products for domestic and imported automobiles, vans, and trucks. As of December 31, 2020, the company operated 5,616 stores. O'Reilly Automotive, Inc. was founded in 1957 and is headquartered in Springfield, Missouri.",
        "exchange": "NASDAQ",
        "sector": "Consumer Discretionary",
        "subindustry": "Automotive Retail",
        "industry": "Specialty Retail",
        "market_cap": 43181,
        "price": 635.16,
        "pe": "21.2",
        "ev_ebitda": "15.0"
    },
    "ORMP:US": {
        "description": "Oramed Pharmaceuticals Inc. engages in the research and development of pharmaceutical solutions for the treatment of diabetes and for the use of orally ingestible capsules or pills for delivery of polypeptides. Its proprietary flagship product is the ORMD-0801, an orally ingestible insulin capsule, which completed phase II clinical trials for the treatment of individuals with diabetes. It is also developing ORMD-0901, an oral glucagon-like peptide-1 capsule that has completed phase I clinical trials for the treatment of type 2 diabetes; and a weight loss treatment in the form of an oral leptin capsule. The company was formerly known as Integrated Security Technologies, Inc. and changed its name to Oramed Pharmaceuticals Inc. in April 2006. Oramed Pharmaceuticals Inc. was founded in 2002 and is based in New York, New York.",
        "exchange": "NASDAQ",
        "sector": "Health Care",
        "subindustry": "Pharmaceuticals",
        "industry": "Pharmaceuticals",
        "market_cap": 967,
        "price": 29.75,
        "pe": "-52.6",
        "ev_ebitda": "-45.7"
    },
    "ORN:US": {
        "description": "Orion Group Holdings, Inc. operates as a specialty construction company in the building, industrial, and infrastructure sectors in the continental United States, Alaska, Canada, and the Caribbean Basin. It operates in two segments, Marine and Concrete. The company provides various marine construction services, including construction, restoration, dredging, maintenance, and repair of marine transportation facilities and pipelines, bridges and causeways, and marine environmental structures. Its marine transportation facility projects comprise public port facilities, cruise ship port facilities, private terminals, special-use navy terminals, recreational use marinas and docks, and other marine-based facilities. The company also offers on-going maintenance and repair, inspection, emergency repair, and demolition and salvage services to marine transportation facilities. Its marine pipeline service projects include the installation and removal of underwater buried pipeline transmission lines; the installation of pipeline intakes and outfalls for industrial facilities; the construction of pipeline outfalls for wastewater and industrial discharges; river crossing and directional drilling; the creation of hot taps and tie-ins; and inspection, maintenance, and repair services. The company's bridge and causeway projects include the construction, repair, and maintenance of overwater bridges and causeways, as well as the development of fendering systems in marine environments; and marine environmental structures used for erosion control, wetlands creation, and environmental remediation. The company also provides specialty services, such as design, salvage, demolition, surveying, towing, diving and underwater inspection, excavation, and repair services. In addition, it offers light commercial, structural, and other concrete construction services. Orion Group Holdings, Inc. was founded in 1994 and is headquartered in Houston, Texas.",
        "exchange": "NYSE",
        "sector": "Industrials",
        "subindustry": "Construction & Engineering",
        "industry": "Construction & Engineering",
        "market_cap": 140,
        "price": 4.51,
        "pe": "-67.6",
        "ev_ebitda": "5.8"
    },
    "ORSUF:US": {
        "description": "Orsu Metals Corporation explores for and develops mineral properties in Russia. The company primarily explores for copper, gold, and molybdenum deposits. It principally holds a 90% interest in the Sergeevskoe gold project that covers an area of 7.6 square kilometers located in the Mogocha District of the Zabaikal'skiy region of Russia. The company was formerly known as European Minerals Corporation and changed its name to Orsu Metals Corporation in June 2008. Orsu Metals Corporation was incorporated in 1987 and is headquartered in Road Town, the British Virgin Islands.",
        "exchange": "OTC",
        "sector": "Materials",
        "subindustry": "Gold",
        "industry": "Metals & Mining",
        "market_cap": 8,
        "price": 0.2,
        "pe": "-21.7",
        "ev_ebitda": "-25.7"
    },
    "OSB:US": {
        "description": "Norbord Inc. manufactures and sells wood-based panels for retail chains, contractor supply yards, and industrial manufacturers primarily in North America and Europe. The company offers oriented strand boards for use in sheathing, flooring, and roofing in home construction applications; particleboards that are used in flooring and other construction applications; and medium density fiberboards for use in cabinet doors, moldings, and interior wall paneling applications, as well as related value-added products for use in the construction of new homes, and renovation and repair of existing structures. It markets its products under the Durastrand pointSIX, Pinnacle, Stabledge, TruFlor pointSIX and TruFlor, Rimboard, SteadiTred, QuakeZone, Tallwall, Trubord and Windstorm, SolarBord, TruDeck, StableDec, SterlingOSB, Caberwood MDF, Conti, and Caberboard brand names. The company was formerly known as Nexfor Inc. and changed its name to Norbord Inc. in June 2004. Norbord Inc. was founded in 1987 and is headquartered in Toronto, Canada.",
        "exchange": "NYSE",
        "sector": "Materials",
        "subindustry": "Forest Products",
        "industry": "Paper & Forest Products",
        "market_cap": 3640,
        "price": 472,
        "pe": "15.9",
        "ev_ebitda": "8.1"
    },
    "OSBC:US": {
        "description": "Old Second Bancorp, Inc. operates as the bank holding company for Old Second National Bank that provides a range of banking services. It provides demand, NOW, money market, savings, time deposit, individual retirement, and checking accounts, as well as certificate of deposit accounts. The company also offers commercial loans; lease financing receivables; commercial real estate loans; construction loans; residential real estate loans, such as residential first mortgage and second mortgage loans; home equity line of credit; consumer loans, including motor vehicle, home improvement, and signature loans; installment and agricultural loans; residential mortgages; and overdraft checking. Further, it provides safe deposit services; trust and wealth management services; and money orders, cashier's checks, foreign currency, direct deposits, discount brokerage, debit and credit cards, and other services, as well as acquires the U.S. treasury notes and bonds. In addition, the company offers online and mobile banking; corporate cash management products, including remote and mobile deposits capture, investment sweep accounts, zero balance accounts, automated tax payments, automatic teller machines access, telephone banking, lockbox accounts, automated clearing house transactions, account reconciliation, controlled disbursement, detail and general information reporting, foreign and domestic wire transfers, and vault services for currency and coin; and investment, agency, and custodial services for individual, corporate, and not-for-profit clients. It operates through 29 banking centers in Cook, DeKalb, DuPage, Kane, Kendall, LaSalle, and Will counties in Illinois. Old Second Bancorp, Inc. was incorporated in 1981 and is headquartered in Aurora, Illinois.",
        "exchange": "NASDAQ",
        "sector": "Financials",
        "subindustry": "Regional Banks",
        "industry": "Banks",
        "market_cap": 401,
        "price": 13.99,
        "pe": "10.8",
        "ev_ebitda": "0.6"
    },
    "OSG:US": {
        "description": "Overseas Shipholding Group, Inc., together with its subsidiaries, owns and operates a fleet of oceangoing vessels. Its vessels are engaged in the transportation of crude oil and petroleum products in the United States flag trades. As of December 31, 2019, the company owned or operated a fleet of 21 vessels totaling an aggregate of approximately 1 million deadweight tons. It serves independent oil traders, refinery operators, and the United States and international government entities. The company was founded in 1948 and is headquartered in Tampa, Florida.",
        "exchange": "NYSE",
        "sector": "Energy",
        "subindustry": "Oil & Gas Storage & Transportation",
        "industry": "Oil, Gas & Consumable Fuels",
        "market_cap": 177,
        "price": 2.04,
        "pe": "-6.3",
        "ev_ebitda": "9.4"
    },
    "OSIS:US": {
        "description": "OSI Systems, Inc. designs, manufactures, and sells electronic systems and components worldwide. It operates through three segments: Security, Healthcare, and Optoelectronics and Manufacturing. The Security segment offers baggage and parcel inspection, cargo and vehicle inspection, radiation detection, hold baggage and people screening, and explosive and narcotics trace detection systems under the Rapiscan Systems and AS&E names. It also provides site design, installation, training, and technical support services; and security screening solutions under the S2 name. The Healthcare segment offers patient monitoring and diagnostic cardiology systems, and related supplies and accessories under the Spacelabs name for use in critical care, emergency, and perioperative areas within hospitals, physicians' offices, medical clinics, and ambulatory surgery centers. The Optoelectronics and Manufacturing segment provides optoelectronic devices under the OSI Optoelectronics, OSI LaserDiode, OSI Laserscan, Semicoa, and Advanced Photonix names for the aerospace and defense, avionics, medical imaging and diagnostics, biochemistry analysis, pharmaceutical, nanotechnology, telecommunications, construction, and homeland security markets. It also offers electronics manufacturing services to original equipment manufacturers and end users for medical, automotive, defense, aerospace, industrial, and consumer applications under the OSI Electronics, APlus Products, Altaflex, and PFC names; and LCD displays for medical, industrial, and consumer electronics applications, as well as flex circuits for OEM customers. This segment offers laser-based remote sensing devices to detect and classify vehicles in toll and traffic management systems under the OSI Laserscan and Autosense names; and solid-state laser products for aerospace, defense, telecommunication, and medical applications under the OSI LaserDiode name. The company was incorporated in 1987 and is headquartered in Hawthorne, California.",
        "exchange": "NASDAQ",
        "sector": "Information Technology",
        "subindustry": "Electronic Equipment & Instruments ",
        "industry": "Electronic Equipment, Instruments & Components",
        "market_cap": 1703,
        "price": 95.14,
        "pe": "20.3",
        "ev_ebitda": "9.6"
    },
    "OSK:US": {
        "description": "Oshkosh Corporation designs, manufactures, and markets specialty vehicles and vehicle bodies worldwide. The company's Access Equipment segment provides aerial work platforms and telehandlers for use in various construction, industrial, institutional, and general maintenance applications. This segment also offers rental fleet loans and leases, and floor plan and retail financing through third-party funding arrangements; towing and recovery equipment; carriers and wreckers; equipment installation services; and chassis and service parts sales. Its Defense segment provides heavy, medium, and light tactical wheeled vehicles and related services for the department of defense. The company's Fire & Emergency segment offers custom and commercial firefighting vehicles and equipment; and commercial fire apparatus and emergency vehicles, such as pumpers, aerial platform, ladder and tiller trucks, tankers, rescue vehicles, wild land rough terrain response vehicles, mobile command and control centers, bomb squad vehicles, hazardous materials control vehicles, and other emergency response vehicles. This segment also provides aircraft rescue and firefighting, snow removal, and broadcast vehicles, as well as command trucks, and military simulator shelters and trailers. Its Commercial segment offers front-and rear-discharge concrete mixers for the concrete ready-mix industry; refuse collection vehicles and related components to commercial and municipal waste haulers; and field service vehicles and truck-mounted cranes for the construction, equipment dealer, building supply, utility, tire service, railroad, and mining industries. Oshkosh Corporation provides its products through direct sales representatives, dealers, and distributors. The company was formerly known as Oshkosh Truck Corporation and changed its name to Oshkosh Corporation in February 2008. Oshkosh Corporation was founded in 1917 and is headquartered in Oshkosh, Wisconsin.",
        "exchange": "NYSE",
        "sector": "Industrials",
        "subindustry": "Construction Machinery & Heavy Trucks",
        "industry": "Machinery",
        "market_cap": 7919,
        "price": 116.2,
        "pe": "16.8",
        "ev_ebitda": "11.3"
    },
    "CBWA:US": {
        "description": "Commencement Bancorp Inc. operates as a bank holding company for Commencement Bank that provides various banking products and services for individuals, and small and midsized businesses in western Washington. It accepts non-interest-bearing, demand, savings, NOW, money market, and time deposits, as well as certificates of deposit. The company also offers commercial real estate loans, including residential 1-4 family, multi-family, commercial, construction, and land; consumer, government guaranteed, and other loans; credit and debit cards; and ATM services. It has four branches in Tacoma, Enumclaw, Auburn, and Olympiad Washington. The company was founded in 2006 and is headquartered in Tacoma, Washington.",
        "exchange": "OTC",
        "sector": null,
        "subindustry": null,
        "industry": null,
        "market_cap": 56,
        "price": 13.45,
        "pe": "13.2",
        "ev_ebitda": "5.9"
    },
    "OSUR:US": {
        "description": "OraSure Technologies, Inc., together with its subsidiaries, develops, manufactures, markets, and sells oral fluid diagnostic products and specimen collection devices in the United States, Europe, and internationally. The company operates in two segments, Diagnostics and Molecular Solutions. The company also offers other diagnostic products, such as immunoassays and other in vitro diagnostic tests. The company's principal products include OraQuick Rapid HIV test, OraQuick In-Home HIV test, OraQuick HIV self-test, OraQuick HCV rapid antibody test, OraQuick Ebola rapid antigen test, OraSure oral fluid collection device used in conjunction with screening and confirmatory tests for HIV-1 antibodies; Intercept drug testing systems; immunoassay tests and reagents; and Q.E.D. saliva alcohol test. It also offers genomic products under the Oragene and ORAcollect brands; microbiome collection products; and GenoFIND services, a suite of genomic services. In addition, the company offers ORAcollect, RNA and OMNIgene, and RAL collection devices for use in connection with COVID-19 molecular testing; manufactures and sells kits that are used to collect, stabilize, transport, and store samples of genetic material for molecular testing in the consumer genetic, clinical genetic, academic research, infectious disease diagnostics, pharmacogenomics, personalized medicine, microbime, and animal genetics markets. The company markets its products to clinical laboratories, hospitals, clinics, community-based organizations and other public health organizations, distributors, government agencies, physicians' offices, and commercial and industrial entities. OraSure Technologies, Inc. was incorporated in 2000 and is based in Bethlehem, Pennsylvania.",
        "exchange": "NASDAQ",
        "sector": "Health Care",
        "subindustry": "Health Care Supplies",
        "industry": "Health Care Equipment & Supplies",
        "market_cap": 731,
        "price": 10.01,
        "pe": "-68.0",
        "ev_ebitda": "44.5"
    },
    "OTEL:US": {
        "description": "Otelco Inc. provides a range of telecommunications services on a retail and wholesale basis. It offers local services, including voice lines that provide local dial tone and calling features, such as caller identification, call waiting, call forwarding, and voicemail; long distance services; and directory advertising services, as well as billing and payments services. The company also provides network access services comprising the origination, transportation, and termination of calls of long distance, wireless, and other interexchange carriers; digital high-speed data lines and ancillary services, such as web hosting and computer virus protection; and basic, digital, high-definition, digital video recording, and pay per view cable television services, as well as rents fiber to transport data and other telecommunications services. In addition, it offers Internet protocol television; wireless security systems and system monitoring services; information technology and support systems that include an operational support and a customer care/billing system; and private/hybrid cloud hosting services, as well as consulting and professional IT engineering services for mission-critical software applications for small and mid-sized companies. The company primarily serves business and residential customers residing in and adjacent to the exchanges in Alabama, Maine, Massachusetts, Missouri, Vermont, and West Virginia; and business customers in Maine and New Hampshire. The company was incorporated in 1998 and is based in Oneonta, Alabama.",
        "exchange": "NASDAQ",
        "sector": "Communication Services",
        "subindustry": "Integrated Telecommunication Services",
        "industry": "Diversified Telecommunication Services",
        "market_cap": 40,
        "price": 0.752,
        "pe": "6.3",
        "ev_ebitda": "4.7"
    },
    "OTEX:US": {
        "description": "Open Text Corporation engages in the designs, develops, markets, and sells information management software and solutions. It offers content services; business network that manages data within the organization and outside the firewall; security and protection solutions for defending against cyber threats, and preparing for business continuity and response in the event of a breach; digital investigation and forensic security solutions; OpenText security solutions to address information cyber resilience needs; Carbonite and Webroot products; and OpenText Information Management software platform. The company also provides Discovery platform that provides forensics and unstructured data analytics; OpenText Developer Cloud; key developer API services; AI and analytics that leverages structured or unstructured data; digital process automation solutions, which enables organizations to transform into digital data-driven businesses; and OpenText Digital Experience platform. In addition, it offers customer support programs, including access to software upgrades, a knowledge base, discussions, product information, and an online mechanism to post and review trouble tickets; and consulting and learning services relating to the implementation, training, and integration of its licensed product offerings, as well as cloud services. The company serves organizations, enterprise and mid-market companies, public sector agencies, small and medium-sized businesses, and direct consumers in Canada, the United States, the United Kingdom, Germany, rest of Europe, the Middle East, Africa, and internationally. It has strategic partnerships with SAP SE, Google Cloud, Amazon AWS, Microsoft Corporation, Oracle Corporation, Salesforce.com Corporation, Accenture plc, ATOS, Capgemini Technology Services SAS, Cognizant Technology Solutions U.S. Corp., Deloitte Consulting LLP, and Tata Consultancy Services. The company was incorporated in 1991 and is headquartered in Waterloo, Canada.",
        "exchange": "NASDAQ",
        "sector": "Information Technology",
        "subindustry": "Application Software",
        "industry": "Software",
        "market_cap": 14169,
        "price": 51.95,
        "pe": "45.6",
        "ev_ebitda": "12.8"
    },
    "OTIC:US": {
        "description": "Otonomy, Inc., a biopharmaceutical company, develops therapeutics for neurotology in the United States. The company offers OTIPRIO, a ciprofloxacin otic suspension for use during tympanostomy tube placement surgery in pediatric patients. It also develops OTIVIDEX, a sustained-exposure formulation of the steroid dexamethasone that has completed Phase III clinical trial for the treatment of Ménière's disease; OTO-313, a sustained-exposure formulation of N-methyl-D-aspartate receptor antagonist gacyclidine, which has completed Phase I/II clinical trial to treat tinnitus; and OTO-413, a sustained-exposure formulation of brain-derived neurotrophic factor that is in Phase I/II clinical trial for the repair of cochlear synaptopathy and the treatment of speech-in-noise hearing difficulties. In addition, the company develops OTO-510, an otoprotectant for the prevention of cisplatin-induced hearing loss; OTO-825, a gene therapy for the treatment of congenital hearing loss; and OTO-6XX induces hair cell repair and regeneration for the treatment of severe hearing loss. The company has license agreements with University of California and DURECT Corporation; and strategic collaboration with Applied Genetic Technologies Corporation to develop and commercialize gene therapy for congenital hearing loss. Otonomy, Inc. was incorporated in 2008 and is headquartered in San Diego, California.",
        "exchange": "NASDAQ",
        "sector": "Health Care",
        "subindustry": "Pharmaceuticals",
        "industry": "Pharmaceuticals",
        "market_cap": 121,
        "price": 2.15,
        "pe": "-2.6",
        "ev_ebitda": "-0.9"
    },
    "OTTR:US": {
        "description": "Otter Tail Corporation, together with its subsidiaries, engages in electric utility, manufacturing, and plastic pipe businesses in the United States. The company's Electric segment produces, transmits, distributes, and sells electric energy in Minnesota, North Dakota, and South Dakota; and operates as a participant in the Midcontinent Independent System Operator, Inc. markets. This segment generates electricity through coal, wind and hydro, and natural gas. It serves approximately 133,000 residential, commercial, industrial, and other customers. Its Manufacturing segment engages in the contract machining, metal parts stamping, fabrication and painting, and production of plastic thermoformed horticultural containers, life science and industrial packaging, and material handling components, and extruded raw material stock for recreational vehicle, agricultural, oil and gas, lawn and garden, and industrial and energy equipment industries. It also manufactures clamshell packing, blister packs, returnable pallets, and handling trays for shipping and storing odd-shaped or difficult-to-handle parts for customers in the medical and life sciences, industrial, recreation, and electronics industries. The company's Plastics segment manufactures polyvinyl chloride pipes for municipal water, rural water, wastewater, storm drainage and water reclamation system, and other uses. This segment markets its products to wholesalers and distributors through independent sales representatives, company salespersons, and customer service representatives. The company was formerly known as Otter Tail Power Company and changed its name to Otter Tail Corporation in 2001. Otter Tail Corporation was founded in 1907 and is headquartered in Fergus Falls, Minnesota.",
        "exchange": "NASDAQ",
        "sector": "Utilities",
        "subindustry": "Electric Utilities",
        "industry": "Electric Utilities",
        "market_cap": 2719,
        "price": 65.46,
        "pe": "18.9",
        "ev_ebitda": "11.2"
    },
    "PBAM:US": {
        "description": "Private Bancorp of America, Inc. operates as the bank holding company for CalPrivate Bank that provides banking products and services to individuals and businesses in California. The company's personal banking services include personal checking and savings, certificate of deposit, and retirement accounts; additional services, such as direct deposits, online banking, ATMs/debit cards, credit cards, savings/line of credit overdraft protection, and safe deposit boxes; and certificate of deposit account registry services. Its business banking services consist of business checking and savings accounts, sweep accounts; and business services comprising treasury management, merchant card, bill pay, positive pay, e-statement, remote deposit capture, wire transfer services, electronic payments and collections, electronic check acceptance, account reconciliation, cash vault, and gift and business credit cards, as well as funds management services. The company also offers commercial real estate, small business administration, construction, and equipment and business expansion loans, as well as revolving lines of credit and letters of credit. The company has offices in La Jolla, San Diego, Coronado, Newport Beach, Beverly Hills, El Segundo, Temecula, Mission Valley, and Redlands. Private Bancorp of America, Inc. was founded in 2006 and is headquartered in La Jolla, California.",
        "exchange": "OTC",
        "sector": null,
        "subindustry": null,
        "industry": null,
        "market_cap": 151,
        "price": 26.99,
        "pe": "9.6",
        "ev_ebitda": "4.5"
    },
    "OUT:US": {
        "description": "OUTFRONT leverages the power of technology, location and creativity to connect brands with consumers outside of their homes through one of the largest and most diverse sets of billboard, transit, and mobile assets in North America. Through its technology platform, OUTFRONT will fundamentally change the ways advertisers engage audiences on-the-go.",
        "exchange": "NYSE",
        "sector": "Real Estate",
        "subindustry": "Specialized REITs ",
        "industry": "Equity Real Estate \nInvestment Trusts \n(REITs)",
        "market_cap": 4038,
        "price": 27.74,
        "pe": "-51.9",
        "ev_ebitda": "30.9"
    },
    "CCCC:US": {
        "description": "C4 Therapeutics, Inc., a biopharmaceutical company, develops novel therapeutic candidates to target and destroy disease-causing proteins for the treatment of cancer, neurodegenerative conditions, and other diseases. Its lead product candidate is CFT7455, an orally bioavailable degrader that is in preclinical stage targeting IKZF1/3 for multiple myeloma and non-Hodgkin lymphomas, including peripheral T-cell lymphoma and mantle cell lymphoma. The company is also developing CFT8634, an orally bioavailable degrader of BRD9, a protein target for synovial sarcoma and SMARCB1-deleted solid tumors; and BRAF V600E to treat melanoma, non-small cell lung cancer, colorectal cancer, and other solid malignancies, as well as RET to treat lung cancer, sporadic medullary thyroid cancers, and other solid malignancies. C4 Therapeutics, Inc. has strategic collaborations with F. Hoffman-La Roche Ltd.; Biogen, Inc.; and Calico Life Sciences LLC. The company was incorporated in 2015 and is headquartered in Watertown, Massachusetts.",
        "exchange": "NASDAQ",
        "sector": "Health Care",
        "subindustry": "Biotechnology",
        "industry": "Biotechnology",
        "market_cap": 2334,
        "price": 46.18,
        "pe": "-31.0",
        "ev_ebitda": "-30.3"
    },
    "OXFD:US": {
        "description": "Oxford Immunotec Global PLC, a diagnostics company, focuses on developing and commercializing proprietary tests for immunology and infectious diseases in the United States, Europe, Asia, and internationally. The company develops its products using its T-SPOT technology platform that measures marker-specific cellular (T cells) responses at a single cell level and inform the diagnosis, prognosis, and monitoring of patients with immune-regulated conditions. It develops and markets T-SPOT.TB test used to test for tuberculosis; and reagents and methods to purify white blood cells for use in immunology assays. In addition, the company offers T-SPOT.CMV, an immune monitoring test for cytomegalovirus (CMV) for the quantification of effector T cells that respond to stimulation by antigens specific for CMV, as well as for the monitoring of CMV-seropositive responses in transplant recipients at various time-points post-transplantation applications. It serves independent laboratories, hospital systems, and public and private institutions. Oxford Immunotec Global PLC was founded in 2002 and is headquartered in Abingdon, the United Kingdom.",
        "exchange": "NASDAQ",
        "sector": "Health Care",
        "subindustry": "Health Care Equipment",
        "industry": "Health Care Equipment & Supplies",
        "market_cap": 562,
        "price": 21.99,
        "pe": "-32.1",
        "ev_ebitda": "-25.4"
    },
    "ROOT:US": {
        "description": "Root, Inc. provides insurance products and services in the United States. The company offers auto, homeowners, and renters insurance products. The company operates a direct-to-consumer model and serves customers primarily through mobile applications, as well as through its website. Its direct distribution channels also cover digital, media, and referral channels, as well as distribution partners. The company was incorporated in 2015 and is headquartered in Columbus, Ohio.",
        "exchange": "NASDAQ",
        "sector": null,
        "subindustry": null,
        "industry": null,
        "market_cap": 1286,
        "price": 5.07,
        "pe": "-3.6",
        "ev_ebitda": "-1.1"
    },
    "OXM:US": {
        "description": "Oxford Industries, Inc., an apparel company, designs, sources, markets, and distributes products of lifestyle and other brands worldwide. The company offers men's and women's sportswear and related products under the Tommy Bahama brand; women's and girl's dresses and sportswear, scarves, bags, jewelry, and belts, as well as footwear and children's apparel under the Lilly Pulitzer brand; and men's shirts, pants, shorts, outerwear, ties, swimwear, footwear, and accessories, as well as women and youth products under the Southern Tide brand. It also designs, sources, markets, and distributes premium childrenswear, including bonnets, hats, apparel, swimwear, and accessories through thebeaufortbonnetcompany.com and wholesale specialty retailers; men's apparel including pants, shorts, and tops through duckhead.com and wholesale specialty retailers. In addition, the company licenses Tommy Bahama brand for various products that include indoor furniture, outdoor furniture, beach chairs, bedding and bath linens, fabrics, leather goods and gifts, headwear, hosiery, sleepwear, shampoo, toiletries, fragrances, cigar accessories, distilled spirits, and other products; Lilly Pulitzer for stationery and gift products, home furnishing products, and eyewear; and Southern Tide trademark for bed and bath product. Oxford Industries, Inc. offers products through its retail stores and e-commerce sites, department stores, specialty stores, multi-branded e-commerce retailers, off-price retailers, and other retailers. It operates 187 brand-specific full-price retail stores; 20 Tommy Bahama food and beverage locations; and 35 Tommy Bahama outlet stores. Oxford Industries, Inc. was founded in 1942 and is headquartered in Atlanta, Georgia.",
        "exchange": "NYSE",
        "sector": "Consumer Discretionary",
        "subindustry": "Apparel, Accessories & Luxury Goods",
        "industry": "Textiles, Apparel & Luxury Goods",
        "market_cap": 1699,
        "price": 100.62,
        "pe": "29.8",
        "ev_ebitda": "14.0"
    },
    "OXY:US": {
        "description": "Occidental Petroleum Corporation, together with its subsidiaries, engages in the acquisition, exploration, and development of oil and gas properties in the United States, the Middle East, Africa, and Latin America. The company operates through three segments: Oil and Gas, Chemical, and Marketing and Midstream. The company's Oil and Gas segment explores for, develops, and produces oil and condensate, natural gas liquids (NGLs), and natural gas. Its Chemical segment manufactures and markets basic chemicals, including chlorine, caustic soda, chlorinated organics, potassium chemicals, ethylene dichloride, chlorinated isocyanurates, sodium silicates, and calcium chloride; vinyls comprising vinyl chloride monomer, polyvinyl chloride, and ethylene. The company's Midstream and Marketing segment gathers, processes, transports, stores, purchases, and markets oil, condensate, NGLs, natural gas, carbon dioxide, and power. This segment also trades around its assets consisting of transportation and storage capacity; and invests in entities. Occidental Petroleum Corporation was founded in 1920 and is headquartered in Houston, Texas.",
        "exchange": "NYSE",
        "sector": "Energy",
        "subindustry": "Integrated Oil & Gas",
        "industry": "Oil, Gas & Consumable Fuels",
        "market_cap": 32442,
        "price": 34.29,
        "pe": "-6.9",
        "ev_ebitda": "7.6"
    },
    "P:US": {
        "description": "Pandora Media, Inc. provides music discovery platform services in the United States and internationally. The company offers streaming radio and on-demand music services, which enable the listeners to create personalized stations and playlists, as well as search and play songs and albums on-demand. It also provides Pandora?Ad-Supported Radio Service, an ad-supported service that allows listeners to access a catalog of music, comedy, livestreams, and podcasts through its personalized playlist generating system for free across its various delivery platforms, as well as Premium Access, a service to listeners to access on-demand listening experience; and Pandora Plus, a subscription radio service, which also includes replays, additional skipping of songs, offline listening, higher quality audio on supported devices, and longer timeout-free listening. In addition, the company offers Pandora Premium, an on-demand subscription service that provides users the ability to search, play, and collect songs and albums; build playlists on their own or with the tap of a button; listen to curated playlists; and share playlists on social networks. Pandora Media, Inc. was founded in 2000 and is headquartered in Oakland, California.",
        "exchange": "NYSE",
        "sector": "Communication Services",
        "subindustry": "Movies & Entertainment",
        "industry": "Entertainment",
        "market_cap": 0,
        "price": 11058.2,
        "pe": "-0.0",
        "ev_ebitda": "-0.1"
    },
    "PAA:US": {
        "description": "Plains All American Pipeline, L.P., through its subsidiaries, engages in the pipeline transportation, terminalling, storage, and gathering of crude oil and natural gas liquids (NGL) in the United States and Canada. The company operates through three segments: Transportation, Facilities, and Supply and Logistics. The Transportation segment transports crude oil and NGL through pipelines, gathering systems, and trucks. As of December 31, 2020, this segment owned and leased 18,370 miles of active crude oil and NGL pipelines and gathering systems; 35 million barrels of active and above-ground tank capacity; and 815 trailers. The Facilities segment provides storage, terminalling, and throughput services for crude oil, NGL, and natural gas; and NGL fractionation and isomerization, and natural gas and condensate processing services. As of December 31, 2020, this segment owned and operated approximately 75 million barrels of crude oil storage capacity; 28 million barrels of NGL storage capacity; 68 billion cubic feet (Bcf) of natural gas storage working capacity; 25 Bcf of base gas; five natural gas processing plants; a condensate processing facility; eight fractionation plants; 22 crude oil and NGL rail terminals; five marine facilities; and approximately 330 miles of active pipelines. The Supply and Logistics segment engages in the purchase, logistics, and resale of crude oil and NGL. As of December 31, 2020, this segment owned 16 million barrels of crude oil and NGL linefill; 4 million barrels of crude oil and NGL linefill; 680 trucks and 840 trailers; and 6,000 crude oil and NGL railcars. The company was incorporated in 1998 and is headquartered in Houston, Texas.",
        "exchange": "NASDAQ",
        "sector": "Energy",
        "subindustry": "Oil & Gas Storage & Transportation",
        "industry": "Oil, Gas & Consumable Fuels",
        "market_cap": 7740,
        "price": 10.79,
        "pe": "67.3",
        "ev_ebitda": "11.3"
    },
    "PAAS:US": {
        "description": "Pan American Silver Corp., together with its subsidiaries, engages in the exploration, development, extraction, processing, refining, and reclamation of silver, gold, zinc, lead, and copper mines in Canada, Mexico, Peru, Argentina, and Bolivia. It holds interests in the La Colorada, Dolores, Huaron, Morococha, Shahuindo, La Arena, Timmins West, Bell Creek, Manantial Espejo, San Vicente, Pas Corp, and Navidad mines. The company was formerly known as Pan American Minerals Corp. and changed its name to Pan American Silver Corp. in April 1995. Pan American Silver Corp. was incorporated in 1979 and is headquartered in Vancouver, Canada.",
        "exchange": "NASDAQ",
        "sector": "Materials",
        "subindustry": "Silver",
        "industry": "Metals & Mining",
        "market_cap": 5562,
        "price": 26.45,
        "pe": "18.7",
        "ev_ebitda": "8.7"
    },
    "PACW:US": {
        "description": "PacWest Bancorp operates as the bank holding company for Pacific Western Bank that provides various banking products and services. The company accepts demand, money market, and time deposits. It also provides real estate loans to professional developers and real estate investors for the acquisition, refinancing, renovation, and construction of commercial real estate properties; small business administration loans; asset-based loans for working capital needs; venture capital loans to support the operations of entrepreneurial and venture-backed companies; and equipment-secured loans and leases. In addition, the company offers consumer loans comprising personal loans, auto loans, home equity lines of credit, revolving lines of credit, and other loans. Further, it provides international banking and multi-state deposit services; money market sweep products; investment advisory and asset management services; treasury and cash management services; telephone banking, remote deposit, and online and mobile banking services; and automated teller machine services. The company offers its products and services to small and mid-sized companies, venture capital and private equity investors, professionals, and other individuals. It operates through 70 full-service branches located in California; one branch located in Durham, North Carolina; one branch located in Denver, Colorado; and various loan production offices. The company was formerly known as First Community Bancorp and changed its name to PacWest Bancorp in April 2008. PacWest Bancorp was founded in 1999 and is headquartered in Beverly Hills, California.",
        "exchange": "NASDAQ",
        "sector": "Financials",
        "subindustry": "Regional Banks",
        "industry": "Banks",
        "market_cap": 5885,
        "price": 49.22,
        "pe": "10.0",
        "ev_ebitda": "3.5"
    },
    "PAG:US": {
        "description": "Penske Automotive Group, Inc., a diversified transportation services company, operates automotive and commercial truck dealerships. The company operates through four segments: Retail Automotive, Retail Commercial Truck, Other, and Non-Automotive Investments. It operates dealerships under franchise agreements with various automotive manufacturers and distributors. The company engages in the sale of new and used motor vehicles, and related products and services comprise vehicle and collision repair services, as well as placement of finance and lease contracts, third-party insurance products, and other aftermarket products; and wholesale of parts. It also operates a heavy and medium duty truck dealership, which offers Freightliner and Western Star branded trucks, as well as a range of used trucks, and maintenance and repair services. In addition, it imports and distributes Western Star heavy-duty trucks, MAN heavy and medium duty trucks, buses, and Dennis Eagle refuse collection vehicles with associated parts in Australia, New Zealand, and portions of the Pacific. Further, the company distributes diesel and gas engines, and power systems. The company operates 304 retail automotive franchises, including 142 franchises located in the United States and 162 franchises located outside of the United States; 17 used vehicle supercenters in the United States and the United Kingdom; and 25 commercial truck dealerships in Texas, Oklahoma, Tennessee, Georgia, Utah, and Idaho, the United States, as well as Canada. Penske Automotive Group, Inc. was incorporated in 1990 and is headquartered in Bloomfield Hills, Michigan.",
        "exchange": "NYSE",
        "sector": "Consumer Discretionary",
        "subindustry": "Automotive Retail",
        "industry": "Specialty Retail",
        "market_cap": 8786,
        "price": 110.99,
        "pe": "8.2",
        "ev_ebitda": "7.4"
    },
    "PAGP:US": {
        "description": "Plains GP Holdings, L.P. owns and operates midstream energy infrastructure in the United States and Canada. It operates through three segments: Transportation, Facilities, and Supply and Logistics. The Transportation segment engages in the transportation of crude oil and natural gas liquids (NGLs) on pipelines, gathering systems, and trucks. As of December 31, 2020, this segment owned and leased assets comprising 18,370 miles of crude oil and NGL pipelines and gathering systems; 35 million barrels of above-ground tank capacity; and 815 trailers. The Facilities segment engages in the provision of storage, terminalling, and throughput services primarily for crude oil, NGLs, and natural gas; NGL fractionation and isomerization services; and natural gas and condensate processing services. As of December 31, 2020, this segment owned and operated approximately 75 million barrels of crude oil storage capacity; 28 million barrels of NGL storage capacity; 68 billion cubic feet (Bcf) of natural gas storage capacity; 26 Bcf of base gas; 5 natural gas processing plants; a condensate processing facility; 8 fractionation plants; 22 crude oil and NGL rail terminals; 5 marine facilities; and 330 miles of pipelines. The Supply and Logistics segment engages in the purchase, logistics, and resale of crude oil and NGL. As of December 31, 2020, this segment owned 16 million barrels of crude oil and NGL linefill; 4 million barrels of crude oil and NGL linefill in pipelines owned by third parties and other inventory; 680 trucks and 840 trailers; and 6,000 crude oil and NGL railcars. The company offers logistics services to producers, refiners, and other customers. PAA GP Holdings LLC operates as a general partner of the company. Plains GP Holdings, L.P. was founded in 2013 and is headquartered in Houston, Texas.",
        "exchange": "NASDAQ",
        "sector": "Energy",
        "subindustry": "Oil & Gas Storage & Transportation",
        "industry": "Oil, Gas & Consumable Fuels",
        "market_cap": 2240,
        "price": 11.54,
        "pe": "-1120.1",
        "ev_ebitda": "6.5"
    },
    "PAHC:US": {
        "description": "Phibro Animal Health Corporation develops, manufactures, and supplies a range of animal health and mineral nutrition products for livestock primarily in the United States. It operates through three segments: Animal Health, Mineral Nutrition, and Performance Products. The company develops, manufactures, and markets products for a range of food animals, including poultry, swine, beef and dairy cattle, and aquaculture. Its animal health products also comprise antibacterials that are biological or chemical products used in the animal health industry to treat or to prevent bacterial diseases; anticoccidials primarily used to prevent and control the disease coccidiosis in poultry and cattle; anthelmintics to treat infestations of parasitic intestinal worms; and anti-bloat treatment products for cattle to control bloat in animals grazing on legume or wheat-pasture. In addition, the company offers nutritional specialty products, which enhance nutrition to help improve health and performance; and vaccines to prevent diseases primarily for the poultry and swine markets. Further, it manufactures and markets formulations and concentrations of trace minerals, such as zinc, manganese, copper, iron, and other compounds; and various specialty ingredients for use in the personal care, industrial chemical, and chemical catalyst industries. The company sells its animal health and mineral nutrition products through local sales offices to integrated poultry, swine, and cattle integrators, as well as through commercial animal feed manufacturers, wholesalers, and distributors. It operates in the United States, Latin America, Canada, Europe, the Middle East, Africa, and the Asia Pacific. The company was formerly known as Philipp Brothers Chemicals, Inc. and changed its name to Phibro Animal Health Corporation in July 2003. Phibro Animal Health Corporation was incorporated in 2014 and is headquartered in Teaneck, New Jersey.",
        "exchange": "NASDAQ",
        "sector": "Health Care",
        "subindustry": "Pharmaceuticals",
        "industry": "Pharmaceuticals",
        "market_cap": 888,
        "price": 22.16,
        "pe": "18.3",
        "ev_ebitda": "11.2"
    },
    "PAM:US": {
        "description": "Pampa Energía S.A., an integrated power company, engages in the generation and transmission of electricity in Argentina. It operates through Electricity Generation, Oil and Gas, Petrochemicals, and Holding and Other Business segments. The company generates electricity through combined thermal generation plants, open-cycle gas turbines, and hydroelectric power generation systems, as well as through a wind farm. It has an installed electricity generation capacity of approximately 4,955 megawatts; and 21,090 kilometers of high voltage electricity transmission network in Argentina. The company is also involved in the exploration and production of oil and gas. In addition, it offers petrochemicals, such as styrene, synthetic rubber, and polystyrene. As of December 31, 2020, the company had approximately 13.526 thousands of barrels of oil and LNG, as well as 21.790 millions of cubic meters of natural gas; owned a refinery with an installed capacity of approximately 25.8 thousand barrels per day; and operated a network of 91 gas stations. The company was formerly known as Pampa Holding S.A. and changed its name to Pampa Energía S.A. in September 2008. Pampa Energía S.A. was incorporated in 1945 and is based in Buenos Aires, Argentina.",
        "exchange": "NYSE",
        "sector": "Utilities",
        "subindustry": "Electric Utilities",
        "industry": "Electric Utilities",
        "market_cap": 1057,
        "price": 18.99,
        "pe": "-3.7",
        "ev_ebitda": "4.8"
    },
    "AMLM:US": {
        "description": "American Lithium Minerals, Inc., an exploration stage company, engages in the acquisition and exploration of mining properties in the United States. The company primarily focuses on investigating prospective lithium opportunities. It holds an option to acquire a 100% interest in 88 unpatented mining claims in Esmeralda County, Nevada. The company was formerly known as Nugget Resources Inc. and changed its name to American Lithium Minerals, Inc. in March 2009. American Lithium Minerals, Inc. was founded in 2005 and is based in Henderson, Nevada.",
        "exchange": "OTC",
        "sector": "Materials",
        "subindustry": "Diversified Metals & Mining",
        "industry": "Metals & Mining",
        "market_cap": 23,
        "price": 0.509,
        "pe": "-3.9",
        "ev_ebitda": "-4.4"
    },
    "PAR:US": {
        "description": "PAR Technology Corporation, together with its subsidiaries, provides point-of-sale (POS) solutions to the restaurant and retail industries worldwide. The company operates in two segments, Restaurant/Retail and Government. The Restaurant/Retail segment offers POS technology solutions, including Brink POS, an open solution that integrates with third party products and in-house systems; PixelPoint, an on-premise integrated software solution that provides a self-service ordering, back-office management, and enterprise level loyalty and gift card information sharing services; PAR merchant card payment services; Data Central, a cloud software platform of back-office applications; and PAR EverServ POS platforms. This segment also offers G5 wireless headsets for wireless communication; and installation, technical, and maintenance support services. The Government segment provides intelligence, surveillance, and reconnaissance; systems engineering support and software-based solutions; satellite and telecommunications support; space and satellite control support; and information systems support services to the United States Department of Defense and other federal agencies. The company was founded in 1968 and is headquartered in New Hartford, New York.",
        "exchange": "NYSE",
        "sector": "Information Technology",
        "subindustry": "Electronic Equipment & Instruments ",
        "industry": "Electronic Equipment, Instruments & Components",
        "market_cap": 1779,
        "price": 66.3,
        "pe": "-51.0",
        "ev_ebitda": "-79.8"
    },
    "PARR:US": {
        "description": "Par Pacific Holdings, Inc. owns and operates energy and infrastructure businesses. The company operates in three segments: Refining, Retail, and Logistics. The Refining segment owns and operates four refineries that produces ultra-low sulfur diesel, gasoline, jet fuel, marine fuel, distillate, asphalt, low sulfur fuel oil, and other associated refined products primarily for consumption in Hawaii, Pacific Northwest, Wyoming, and South Dakota. The Retail segment operates 123 fuel retail outlets, which sell merchandise, such as soft drinks, prepared foods, and other sundries in Hawaii under the Hele, 76, and nomnom brands; and gasoline, diesel, and retail merchandise in Washington and Idaho under the Cenex, nomnom, and Zip Trip brand names. The Logistics segment owns and operates terminals, pipelines, a single-point mooring, and trucking operations to distribute refined products throughout the island of Oahu, Maui, Hawaii, Molokai, and Kauai. It also leases marine vessels; owns and operates a crude oil pipeline gathering system, a refined products pipeline, storage facilities, and loading racks in Wyoming; and a jet fuel storage facility and pipeline that serves Ellsworth Air Force Base in South Dakota. In addition, this segment owns and operates a marine terminal, a unit train-capable rail loading terminal, storage facilities, a truck rack, and a proprietary pipeline that serves Joint Base Lewis McChord. The company was formerly known as Par Petroleum Corporation and changed its name to Par Pacific Holdings, Inc. in October 2015. Par Pacific Holdings, Inc. was founded in 1984 and is headquartered in Houston, Texas.",
        "exchange": "NYSE",
        "sector": "Energy",
        "subindustry": "Oil & Gas Refining & Marketing",
        "industry": "Oil, Gas & Consumable Fuels",
        "market_cap": 966,
        "price": 16.04,
        "pe": "-4.4",
        "ev_ebitda": "-6.3"
    },
    "PATI:US": {
        "description": "Patriot Transportation Holding, Inc., through its subsidiary, Florida Rock & Tank Lines, Inc., transports petroleum and other liquids, and dry bulk commodities. The company is involved in hauling petroleum related products, including gas and diesel fuel; and dry bulk commodities, such as cement, lime, and various industrial powder products, as well as liquid chemicals. Its petroleum clients include convenience stores and hypermarket accounts, fuel wholesalers, and oil companies; and dry bulk and chemical customers comprise industrial companies, such as cement and concrete accounts, as well as product distribution companies. As of September 30, 2020, the company operated a fleet of 320 company tractors, 18 owner operators, and 444 trailers from its 18 terminals and 6 satellite locations in Florida, Georgia, Alabama, and Tennessee. Patriot Transportation Holding, Inc. is headquartered in Jacksonville, Florida.",
        "exchange": "NASDAQ",
        "sector": "Industrials",
        "subindustry": "Trucking",
        "industry": "Road & Rail",
        "market_cap": 52,
        "price": 15.34,
        "pe": "46.0",
        "ev_ebitda": "6.5"
    },
    "PATK:US": {
        "description": "Patrick Industries, Inc. manufactures and distributes components, building products, and materials for the recreational vehicle, marine, manufactured housing, and industrial markets in the United States and Canada. Its Manufacturing segment manufactures and sells furniture, shelving, wall, countertop, and cabinet product; cabinet door, fiberglass bath fixture, and tile system; hardwood furniture, vinyl printing, solid surface, granite, and quartz countertop fabrication aluminum product; RV painting; decorative vinyl and paper laminated panel; fiberglass and plastic component; softwoods lumber; custom cabinet; polymer-based flooring product; marine hardware; air handling; and electrical system and component, including instrument and dash panel, and other product. This segment also provides wrapped vinyl, paper, and hardwood profile moulding; interior passage door; slide-out trim and fascia product; thermoformed shower surround; specialty bath and closet building product; treated, untreated, and laminated plywood; fiberglass and plastic helm systems and component; wiring and wire harnesses; aluminum and plastic fuel tank; boat cover, tower, top, and frame; CNC molds and composite part; and slotwall panel and component. The company's Distribution segment distributes pre-finished wall and ceiling panel, drywall and finishing product, electronic, audio system component, appliance, wiring product, electrical and plumbing product, cement siding product, raw and processed lumber, fiber reinforced polyester product, roofing, laminate and ceramic flooring product, shower door, furniture, fireplace and surround, interior and exterior lighting product, and other product. This segment also offers transportation and logistics service. The company was founded in 1959 and is headquartered in Elkhart, Indiana.",
        "exchange": "NASDAQ",
        "sector": "Industrials",
        "subindustry": "Building Products",
        "industry": "Building Products",
        "market_cap": 1867,
        "price": 79.11,
        "pe": "9.3",
        "ev_ebitda": "7.0"
    },
    "AGBAU:US": {
        "description": "AGBA Acquisition Limited does not have significant operations. It intends to effect a merger, share exchange, asset acquisition, stock purchase, recapitalization, reorganization, or other similar business combination with one or more businesses. The company was incorporated in 2018 and is based in Tsim Sha Tsui, Hong Kong.",
        "exchange": "NASDAQ",
        "sector": null,
        "subindustry": null,
        "industry": null,
        "market_cap": 0,
        "price": 11.89,
        "pe": "-0.0",
        "ev_ebitda": "1.3"
    },
    "PAYC:US": {
        "description": "Paycom Software, Inc. provides cloud-based human capital management (HCM) solution delivered as software-as-a-service for small to mid-sized companies in the United States. It offers functionality and data analytics that businesses need to manage the employment life cycle from recruitment to retirement. The company's HCM solution provides a suite of applications in the areas of talent acquisition, including applicant tracking, candidate tracker, background checks, on-boarding, e-verify, and tax credit services; and time and labor management, such as time and attendance, scheduling/schedule exchange, time-off requests, labor allocation, labor management reports/push reporting, and geofencing/geotracking. Its HCM solution also offers payroll applications comprising payroll and tax management, Paycom pay, expense management, mileage tracker/fixed and variable rates, garnishment management, and GL concierge applications; and talent management applications that include employee self-service, compensation budgeting, performance management, and Paycom learning, course content, and subscriptions, as well as my analytics, which offer employment predictor reporting. In addition, the company's HCM solution provides HR management applications comprising manager on-the-go that gives supervisors and managers the ability to perform a variety of tasks, such as approving time-off requests and expense reimbursements; direct data exchange; ask here, a tool for direct line of communication to ask work-related questions; document and checklist; government and compliance; benefits administration/benefits to carrier; COBRA administration; personnel action forms; surveys; and affordable care act applications. Paycom Software, Inc. was founded in 1998 and is headquartered in Oklahoma City, Oklahoma.",
        "exchange": "NYSE",
        "sector": "Information Technology",
        "subindustry": "Application Software",
        "industry": "Software",
        "market_cap": 30627,
        "price": 511.42,
        "pe": "178.4",
        "ev_ebitda": "107.2"
    },
    "PAYX:US": {
        "description": "Paychex, Inc. provides integrated human capital management solutions for human resources (HR), payroll, benefits, and insurance services for small to medium-sized businesses in the United States and Europe. The company offers payroll processing services; payroll tax administration services; employee payment services; and regulatory compliance services, such as new-hire reporting and garnishment processing. It also provides HR solutions, including payroll, employer compliance, HR and employee benefits administration, risk management outsourcing, and the on-site availability of a professionally trained HR representative; and retirement services administration, including plan implementation, ongoing compliance with government regulations, employee and employer reporting, participant and employer online access, electronic funds transfer, and other administrative services. In addition, the company offers cloud-based HR administration software products for employee benefits management and administration, time and attendance, digital communication solutions, recruiting, and onboarding solutions; plan administration outsourcing and state unemployment insurance services; various business services to small to medium-sized businesses comprising payroll funding and outsourcing services, which include payroll processing, invoicing, and tax preparation; and payment processing services, financial fitness programs, and a small-business loan resource center. Further, it provides insurance services for property and casualty coverage, such as workers' compensation, business-owner policies, cyber security protection, and commercial auto, as well as health and benefits coverage, including health, dental, vision, and life. The company markets and sells its services primarily through its direct sales force. Paychex, Inc. was founded in 1971 and is headquartered in Rochester, New York.",
        "exchange": "NASDAQ",
        "sector": "Information Technology",
        "subindustry": "Data Processing & Outsourced Services",
        "industry": "IT Services",
        "market_cap": 44249,
        "price": 123.19,
        "pe": "36.3",
        "ev_ebitda": "24.3"
    },
    "HCRSQ:US": {
        "description": "Hi-Crush Inc., together with its subsidiaries, provides proppant and logistics services for hydraulic fracturing operations in the United States. The company offers raw frac sand used in the hydraulic fracturing process for oil and natural gas wells. It owns and operates various frac sand mining facilities, including a 973 contiguous acre facility located in Wyeville, Wisconsin; a 1,187 contiguous acre facility located in Eau Claire County, Wisconsin; a 1,626 acre facility located in Independence, Wisconsin and Whitehall, Wisconsin; a 1,285 acre facility located in Blair, Wisconsin with on-site processing and truck loading facilities; and a 1,226 acre grass sand reserve located near Kermit, Texas. As of December 31, 2019, the company owned and operated 11 terminal locations throughout Pennsylvania, Ohio, Texas, Colorado, and New York, as well as owned and leased 50 PropBeast conveyors and 2,978 containers, 15 Atlas topfill conveyors, and 35 silo systems. In addition, it offers PropDispatch, a logistics software system. It primarily serves pressure pumping service providers, and oil and gas exploration and production companies. Hi-Crush GP LLC operates as the general partner of the company. The company was formerly known as Hi-Crush Partners LP and changed its name to Hi-Crush Inc. in June 2019. Hi-Crush Inc. was founded in 2012 and is based in Houston, Texas.",
        "exchange": "OTC",
        "sector": null,
        "subindustry": null,
        "industry": null,
        "market_cap": 1,
        "price": 0.0172,
        "pe": "-0.0",
        "ev_ebitda": "-1.6"
    },
    "CWSS:US": {
        "description": "Creative Waste Solutions Inc., through its subsidiaries, provides waste management environmental services to residential, commercial, industrial, and municipal customers in South East of the United States. The company offers waste management brokerage services; and operates waste transfer station that accepts various waste. Creative Waste Solutions, Inc. is based in Boca Raton, Florida.",
        "exchange": "OTC",
        "sector": null,
        "subindustry": null,
        "industry": null,
        "market_cap": 0,
        "price": 0.0085,
        "pe": "-0.0",
        "ev_ebitda": "0.2"
    },
    "MNAT:US": {
        "description": "Marquette National Corporation operates as the bank holding company of Marquette Bank that provides community banking services in Illinois. The company offers a range of banking services, financial solutions, trust, retirement planning, wealth management, home financing, and real estate lending services to both consumers and local businesses. Its products and services include personal and business checking accounts, NOW accounts, personal and business savings and money market accounts, individual retirement accounts, and certificates of deposit; vehicle loans, term loans, lines of credit, collateralized loans, business credit cards, commercial loans, apartment lending, home equity, and home refinancing; and safe deposit box, online banking, business remote deposit, bill pay, mobile banking, and debit card services. The company has 21 branches and two loan production offices with locations in Chicago, Bolingbrook, Bridgeview, Evergreen Park, Hickory Hills, Lemont, New Lenox, Oak Forest, Oak Lawn, Orland Park, Romeoville and Summit, Illinois. The company was founded in 1945 and is based in Chicago, Illinois.",
        "exchange": "OTC",
        "sector": null,
        "subindustry": null,
        "industry": null,
        "market_cap": 158,
        "price": 36.75,
        "pe": "7.4",
        "ev_ebitda": "3.7"
    },
    "GREN:US": {
        "description": "In June 2003, AgroCan Corporation changed its name to Greensmart Corporation in connection with an asset acquisition agreement with Winsmart Development, Ltd. According to the basic terms of the agreement, the company would issue to Winsmart 29,868,737 shares of its common stock. Also, Winsmart would sell to the company approximately 553,212 young eucalyptus trees planted in a total of 340 leased hectares; and a tree seedling and nursery farm situated on 3.3 leased hectares. Greensmart Corporation, through its subsidiary, AgroCan (China), Inc., specializes in producing compound fertilizers, which are custom-made to suit local conditions, such as plant, soil, and climate. Compound fertilizers are the end product made from the combination of the three primary nutrients: nitrogen, phosphate, and potassium, together with other elements, such as iron, zinc, copper, and manganese. These elements are blended in different proportions, and are made into pellets and packed into bags. Fertilizer applications include mainly paddy rice, wheat, corn, sugar cane, tobacco, cotton, vegetables, tree plantation, and fruit trees. The company's fertilizers are sold under the brand name ?AgroCan Three Leaves'. Its main customers for the fertilizers comprise the farming supply bureaus and cooperatives under the State Internal Trade Bureau of the People's Republic of China. These entities act as wholesalers to individual farmers. State-owned farms and plantations are also major accounts of the company. Greensmart Corporation was founded in 1996 and is based in Kwun Tong, Hong Kong.",
        "exchange": "OTC",
        "sector": "Materials",
        "subindustry": "Fertilizers & Agricultural Chemicals",
        "industry": "Chemicals",
        "market_cap": 0,
        "price": 0.0032,
        "pe": "-0.0",
        "ev_ebitda": "0.0"
    },
    "GMNNF:US": {
        "description": "Gamenet Group S.p.A. engages in the gaming and betting business in Italy. The company operates through four segments: Amusement With Prize (AWP), Video Lottery Terminal (VLT), Betting and Online, and Retail and Street Operations. Its AWPs are represented by traditional slot machines. The company engages in the betting and online games, such as poker, casino games, bingo, horse racing, bingo and prediction games, and other sports betting. As of December 31, 2018, its distribution network included 1,732 betting rights; 8,570 VLT licenses; 29,972 AWP operating permits; and 759 gaming halls, of which 70 are directly managed. The company was founded in 2006 and is based in Rome, Italy.",
        "exchange": "OTC",
        "sector": null,
        "subindustry": null,
        "industry": null,
        "market_cap": 412,
        "price": 9.9197,
        "pe": "-34.7",
        "ev_ebitda": "6.1"
    },
    "DIGI:US": {
        "description": "Digitiliti, Inc. provides online data protection solutions to the small and medium business and small to medium enterprise markets in the United States. It offers DigiBAK, an online data backup and recovery service for various machines in a network, including desktops, laptops, and file and print servers. The company also provides DigiLIBE, an information management software that moves and manages information objects, which are human recognized content, such as a word document or an excel spreadsheet. It serves various data intensive industries, including financial services, engineering and scientific, construction, health care, education, and legal services. The company sells and supports its solutions and services through direct sales, value-added remarketers, and third-party integrators. Digitiliti, Inc. is based in Breezy Point, Minnesota.",
        "exchange": "OTC",
        "sector": null,
        "subindustry": null,
        "industry": null,
        "market_cap": 1,
        "price": 0.025,
        "pe": "-0.4",
        "ev_ebitda": "-1.1"
    },
    "FITX:US": {
        "description": "Creative Edge Nutrition, Inc. develops and sells a portfolio of health?oriented nutrition products. The company offers products in the categories of weight loss, metabolic enhancement, recovery/well-being, muscle enhancement and stimulation, and natural line. Its products include MetaBolic Xtreme, a product for weight loss; Hyper-Infusion, a pre-workout powder to enhance endurance and strength; Alpha-Drive, a product for post cycle therapy; Amino Plex, an intra-workout recovery catalyst; Chia Plex, a product for health and well being; and Hemp Nutra Tea and Nutra Coffee additives. The company was formerly known as Laufer Bridge Enterprises Inc. and changed its name to Creative Edge Nutrition, Inc. in April 2012. Creative Edge Nutrition, Inc. is based in Madison Heights, Michigan.",
        "exchange": "OTC",
        "sector": null,
        "subindustry": null,
        "industry": null,
        "market_cap": 0,
        "price": 0.0001,
        "pe": "-0.0",
        "ev_ebitda": "0.2"
    },
    "SRUS:US": {
        "description": "Stratus Capital Corp., a real estate development company, focuses on developing and redeveloping residential, commercial, or mixed used properties in the United States. The company is based in Greenwood Village, Colorado.",
        "exchange": "OTC",
        "sector": null,
        "subindustry": null,
        "industry": null,
        "market_cap": 3,
        "price": 0.1675,
        "pe": "-20.0",
        "ev_ebitda": "-21.4"
    },
    "HKCVF:US": {
        "description": "HK Electric Investments and HK Electric Investments Limited, a vertically integrated power-utility, engages in the generation, transmission, and distribution of electricity in Hong Kong Island and Lamma Island. As of December 31, 2020, the company operated 6 coal-fired units, 5 oil-fired gas turbine units, 3 gas-fired combined-cycle units, 1 solar power system, and 1 wind turbine with an installed capacity of 3,617 megawatts. It also operated a transmission and distribution network of 6,638 kilometers; and 3,944 customer substations, as well as served approximately 583,000 residential, commercial, and industrial customers. The company was incorporated in 1889 and is headquartered in Hong Kong, Hong Kong.",
        "exchange": "OTC",
        "sector": null,
        "subindustry": null,
        "industry": null,
        "market_cap": 9231,
        "price": 0.9823,
        "pe": "25.6",
        "ev_ebitda": "14.8"
    },
    "PBA:US": {
        "description": "Pembina Pipeline Corporation provides transportation and midstream services for the energy industry. It operates through three segments: Pipelines, Facilities, and Marketing & New Ventures. The Pipelines segment operates conventional, oil sands and heavy oil, and transmission assets with a transportation capacity of 3.1 millions of barrels of oil equivalent per day, ground storage of 11 millions of barrels, and rail terminalling capacity of approximately 145 thousands of barrels of oil equivalent per day serving markets and basins across North America. The Facilities segment offers infrastructure that provides customers with natural gas, condensate, and natural gas liquids (NGLs), including ethane, propane, butane, and condensate; and includes 354 thousands of barrels per day of NGL fractionation capacity, 21 millions of barrels of cavern storage capacity, and associated pipeline and rail terminalling facilities. The Marketing & New Ventures segment buys and sells hydrocarbon liquids and natural gas originating in the Western Canadian sedimentary basin and other basins. Pembina Pipeline Corporation was incorporated in 1954 and is headquartered in Calgary, Canada.",
        "exchange": "NYSE",
        "sector": "Energy",
        "subindustry": "Oil & Gas Storage & Transportation",
        "industry": "Oil, Gas & Consumable Fuels",
        "market_cap": 18921,
        "price": 34.4,
        "pe": "-80.6",
        "ev_ebitda": "14.7"
    },
    "ACI:US": {
        "description": "Albertsons Companies, Inc., through its subsidiaries, engages in the operation of food and drug stores in the United States. The company's food and drug retail stores offer grocery products, general merchandise, health and beauty care products, pharmacy, fuel, and other items and services. As of February 27, 2021, it operated 2,277 stores under various banners, including Albertsons, Safeway, Vons, Pavilions, Randalls, Tom Thumb, Carrs, Jewel-Osco, Acme, Shaw's, Star Market, United Supermarkets, Market Street, Haggen, Kings Food Markets, and Balducci's Food Lovers Market; and 1,727 pharmacies, 1,313 in-store branded coffee shops, 400 adjacent fuel centers, 22 distribution centers, and 20 manufacturing facilities, as well as various digital platforms. The company was founded in 1860 and is headquartered in Boise, Idaho. Albertsons Companies, Inc. is a subsidiary of Albertsons Investor Holdings LLC.",
        "exchange": "NYSE",
        "sector": null,
        "subindustry": null,
        "industry": null,
        "market_cap": 15583,
        "price": 33.36,
        "pe": "21.7",
        "ev_ebitda": "6.1"
    },
    "PBCT:US": {
        "description": "People's United Financial, Inc. operates as the bank holding company for People's United Bank, National Association that provides commercial banking, retail banking, and wealth management services to individual, corporate, and municipal customers. The Commercial Banking segment offers commercial deposit products, commercial real estate lending, middle market and business banking, equipment financing, mortgage warehouse and asset-based lending, treasury management services, and capital market capabilities. The Retail Banking segment offers consumer lending, including residential mortgage and home equity lending; and consumer deposit gathering services. This segment also provides brokerage, financial and investment advisory, investment management, life insurance, financial management and planning, and non-institutional trust services. In addition, the company offers cash management, municipal banking, online banking, investment trading, and telephone banking services. It operates through a network of 417 branches in Connecticut, southeastern New York, Massachusetts, Vermont, Maine, and New Hampshire, as well as 631 ATMs. The company was founded in 1842 and is headquartered in Bridgeport, Connecticut.",
        "exchange": "NASDAQ",
        "sector": "Financials",
        "subindustry": "Regional Banks",
        "industry": "Banks",
        "market_cap": 7749,
        "price": 18.12,
        "pe": "25.0",
        "ev_ebitda": "16.6"
    }
}